emacs.org
#+TITLE: Emacs configuration file
#+AUTHOR: Stephen Fromm
#+OPTIONS: toc:4 h:3
#+PROPERTY: header-args:emacs-lisp :tangle "init.el" :results silent :exports code
#+MACRO: export-date (eval (format-time-string "%F %R %z" (current-time)))
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

Updated: *{{{export-date}}}*

* Overview

** Official links to this document

- Git repository ::  https://github.com/sfromm/emacs.d

** What is this?
The following document contains my configuration for [[https://www.gnu.org/software/emacs/][Emacs]].  This is based on
 the idea of [[http://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming][literate programming]], where code and commentary are embedded in the
 same document.  The benefit of this approach is you get all the benefits of
 [[https://orgmode.org][Org-mode]] with [[https://orgmode.org/worg/org-contrib/babel/][Babel]] to lay out and document the code.

I try to use =setq= or =:custom= in =use-package= for much of my configuration.
For those that parts that need to remain private, I will use =customize= or pull
the configuration in via a separate lisp file.

This configuration used to be in straight lisp files, with various modules for
different sets of functionality.  And before that, it was an /Org/ file.  I came
back to laying this out with /Org/ because I ultimately think that there is more
benefit with to tangling from an /Org/ file because you have a lot more tools to
document and describe what the intent is and what some of the more important
pieces are.

This configuration is built to immediately tangle =early-init.el= and =init.el=
whenever I save the file.  For reference, it is possible parse the configuration
without tangling it with something like the following:

#+begin_src emacs-lisp :tangle no
(require 'org)
(org-babel-load-file
 (expand-file-name "emacs.org"
                   user-emacs-directory))
#+end_src

** COPYING

#+NAME: license
#+begin_src emacs-lisp :tangle no
;; Copyright (C) 2021, 2022 by Stephen Fromm

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <http://www.gnu.org/licenses/>.
#+end_src

** Installation
First things first.  Clone the git repository:

#+begin_example
$ git clone https://github.com/sfromm/emacs.d ~/.emacs.d
#+end_example

If you do not already have Emacs installed, you can use the =make install=
target.  On MacOSX, this will use [[https://brew.sh/][Homebrew]] to install Emacs.

On the first time you run this configuration, it will go install several
packages.  This may take awhile, so please be patient.  You can also run the
target =make bootstrap= command to install the main packages needed.

** Configuration

There are a couple directories you use to store any personal or site-specific
configuration.  Everything in =forge-personal-dir= is ignored by /git/.

- =forge-site-dir= :: *~/.emacs.d/site-lisp*
- =forge-personal-dir= :: *~/.emacs.d/user*

