emacs.org
** Updates
You can keep up to date by using the =make update= target.  This will do a few
things:

- Do a =git pull= to pull in the latest changes to /emacs-forge/.
- Run the function =forge/update-packages= to update the installed Emacs packages.

** Inspiration

There are many elements of this configuration that are drawn from other users'
configurations online.  Below is a list, in no particular order, of some of
those configurations that caught my eye.

- [[http://sachachua.com/blog/][Sacha Chua]]'s [[http://sachac.github.io/.emacs.d/Sacha.html][emacs configuration]]
- [[https://github.com/jwiegley/dot-emacs][John Wiegley]]
- [[https://protesilaos.com/][Protesilaos Stavrou]]: [[https://protesilaos.com/dotemacs/][dotemacs]]
- [[http://doc.norang.ca/org-mode.html][Bernt Hansen (norang.ca) Org Mode]] (Organize Your Life in Plain Text)
- [[http://eschulte.github.io/emacs24-starter-kit/][Emacs Starter Kit]]
- [[https://www.wisdomandwonder.com][Grant Rettke]]:  [[https://github.com/grettke/lolsmacs][lolsmacs]], and previously [[https://github.com/grettke/home/blob/master/ALEC.org][ALEC]]
- [[http://kitchingroup.cheme.cmu.edu/blog/][John Kitchin]]:  [[https://github.com/jkitchin/scimax][emacs configuration]]
- [[http://www.howardism.org][Howard Abrams]]:  [[https://github.com/howardabrams/dot-files][Emacs and dot files]]
- [[https://github.com/bzg/dotemacs/blob/master/emacs.el][Bastien Guerry]]
- [[https://github.com/larstvei/dot-emacs][Lars Tveito]]
- [[https://github.com/purcell/emacs.d][Steve Purcell]]
- [[http://zeekat.nl/articles/making-emacs-work-for-me.html][Making Emacs work for me]]
- [[https://github.com/jd/emacs.d][Julien Danmmjou]]
- [[https://github.com/joedicastro/dotfiles/tree/master/emacs][Joe Di Castro]]
- [[http://org.rix.si/][Ryan Rix]]:  [[http://doc.rix.si/cce/cce.html][Complete Computing Environment]] (formerly [[http://doc.rix.si/org/fsem.html][Hardcore Freestyle Emacs]] [[http://fort.kickass.systems:10082/cgit/personal/rrix/pub/fsem.git/tree/fsem.org][org source]])
- [[https://github.com/abelardojarab/emacs-config][Abelardo Jara-Berrocal]]
- [[https://writequit.org][Lee Hinman]]'s [[https://writequit.org/eos/eos.html][Emacs Operating System]] (see https://github.com/dakrone/eos)
- [[http://karl-voit.at/][Karl Voit]]'s [[https://github.com/novoid/dot-emacs][dot-emacs]]
- [[https://github.com/DamienCassou/emacs.d/blob/master/init.el][Damien Cassou]]
- [[https://github.com/hlissner][Henrik Lissner]] [[https://github.com/hlissner/doom-emacs][Doom Emacs]]
- [[https://gitlab.com/ambrevar/dotfiles][Ambrevar]]
- [[http://www.djcbsoftware.nl/dot-emacs.html][DJCB]]
- [[https://luca.cambiaghi.me/vanilla-emacs/readme.html][Luca Cambiaghi]]
* Early initialization
:PROPERTIES:
:header-args:emacs-lisp: :tangle early-init.el
:END:
This uses =package-quickstart= to help with loading packages.  See [[https://git.savannah.gnu.org/cgit/emacs.git/commit/etc/NEWS?id=6dfdf0c9e8e4aca77b148db8d009c862389c64d3][the commit]]
for more information.  To go with this, it is important to precompute the
autoload file using =(package-quickstart-refresh)=.  The quickstart file is
relocated to /.emacs.d/var/.

#+begin_src emacs-lisp :noweb yes
;;; early-init.el --- Early Init File -*- lexical-binding: t -*-
<<license>>

;; native compilation
(when (and (fboundp 'startup-redirect-eln-cache)
           (fboundp 'native-comp-available-p)
           (native-comp-available-p))
  (startup-redirect-eln-cache
   (convert-standard-filename (expand-file-name "var/eln-cache/" user-emacs-directory)))
  (setq native-comp-deferred-compilation nil)
  (setq native-comp-async-report-warnings-errors 'silent))

;; package and package-quickstart
;; In Emacs 27+, package initialization occurs before `user-init-file' is
;; loaded, but after `early-init-file'.
(setq package-quickstart nil                   ;; nope
      package-enable-at-startup nil            ;; nope part deux
      package-quickstart-file (locate-user-emacs-file "var/package-quickstart.el"))

(add-to-list 'load-path (concat user-emacs-directory "lisp"))

;; help startup and garbage collection
(setq warning-suppress-log-types '((comp) (bytecomp)))
(setq byte-compile-warnings '(not obsolete))
(setq gc-cons-threshold most-positive-fixnum)  ;; Set garbage collection to highest threshold
(setq message-log-max 16384)                   ;; Turn up logging settings

;; Set default coding system to UTF-8
(set-language-environment "UTF-8")
#+end_src

=file-name-handler-alist= is consulted on every =require=, =load=, and so on.
Borrowing from [[https://github.com/hlissner/doom-emacs][doom-emacs]], I set this to =nil= temporarily during startup so as
to achieve a minor speed up.

#+begin_src emacs-lisp
(unless (daemonp)
  (defvar init-file-name-handler-alist file-name-handler-alist)
  ;; Crank garbage collection to 11 for initialization.
  ;; Reset after init
  (setq file-name-handler-alist nil))

(defun init-reset-file-handler-alist ()
  "Reset `file-handler-alist' to initial value after startup."
  (setq file-name-handler-alist init-file-name-handler-alist))

(defun init-reset-garbage-collection ()
  "Reset garbage collection settings after startup."
  (setq gc-cons-threshold 16777216 ;; 16mb
        gc-cons-percentage 0.1
        message-log-max 1024))

(defun init-reset-startup-settings ()
  (init-reset-file-handler-alist)
  (init-reset-garbage-collection))

(add-hook 'emacs-startup-hook #'init-reset-startup-settings)

(provide 'early-init)
#+end_src

* Startup
Do some housekeeping to measure start up time.  See [[https://nullprogram.com/blog/2016/12/22/][this post]] on using /lexical binding/.

#+begin_src emacs-lisp :noweb yes
;;; init.el --- Init File -*- lexical-binding: t -*-

<<license>>

(message "Loading up Emacs...")
(defvar init-core-start-time (current-time))

(defun init-report-startup-time ()
  "Report startup time."
  (interactive)
  (message "Emacs is ready, finished loading after %.03fs."
           (float-time (time-subtract after-init-time before-init-time))))

(add-hook 'after-init-hook #'init-report-startup-time)
#+end_src

* Package Management
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/init-elpa.el
:END:
** Set up =package= archives
This defines what package archives are used and then initializes =package=.

#+begin_src emacs-lisp :tangle init.el
(require 'init-elpa)
#+end_src

#+begin_src emacs-lisp :noweb yes
;;; init-elpa.el --- Init ELPA and package management -*- lexical-binding: t -*-
<<license>>


(setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                         ("nongnu" . "https://elpa.nongnu.org/nongnu/")
                         ("melpa" . "https://melpa.org/packages/")))
(package-initialize)
#+end_src

** Helper functions for managing packages
Sometimes installing a new package will bork packages.  This will recompile the /.el/ files.

#+begin_src emacs-lisp
(defun my-package-install (package)
  "Install PACKAGE if not yet installed."
  (unless (fboundp 'package-installed-p)
    (package-initialize))
  (unless (package-installed-p package)
    (message "%s" "Refreshing package database...")
    (package-refresh-contents)
    (message "%s" " done.")
    (package-install package)
    (message "Installed package %s." package)
    (delete-other-windows)))

(defun my-package-upgrade-packages ()
  "Upgrade all installed packages."
  (interactive)
  (save-window-excursion
    (package-refresh-contents)
    (package-list-packages t)
    (package-menu-mark-upgrades)
    (package-menu-execute 'noquery)
    (message "Packages updated.")))

;; Via spacemacs/core/core-funcs.el
;; https://github.com/syl20bnr/spacemacs/blob/c7a103a772d808101d7635ec10f292ab9202d9ee/core/core-funcs.el
(defun my-recompile-elpa ()
  "Recompile packages in elpa directory.  Useful if you switch Emacs versions."
  (interactive)
  (byte-recompile-directory package-user-dir nil t))

;; Via https://emacsredux.com/blog/2020/09/12/reinstalling-emacs-packages/
(defun my-reinstall-package (pkg)
  (interactive (list (intern (completing-read "Reinstall package: " (mapcar #'car package-alist)))))
  (unload-feature pkg)
  (package-reinstall pkg)
  (require pkg))
#+end_src
** Set up =use-package= and other critical packages
I find the [[https://github.com/jwiegley/use-package][use-package]] macro makes a configuration easier to read and more declarative.  This
installs the package, if not already present, and then sets it up.

Additional notes:

- Try out =use-package-compute-statistics= to compute statistics concerned
  use-package declarations.  You can view the report with =use-package-report=.
- There is an option to always defer loading of packages with
  =use-package-always-defer=.  I do not have this enabled because I have some
  times found it more tricky to get a package to load rather than defer manually
  or let =use-package= handle it.  See [[https://jwiegley.github.io/use-package/keywords/#after][discussion]] at end of section on /:after/ keyword.
- Pull in =org= and =org-contrib= as early as possible to make sure ~load-path~
  is set correctly.

#+begin_src emacs-lisp

(defvar init-core-packages '(use-package diminish org org-contrib)
  "A list of core packages that will be automatically installed.")

(defun init-install-core-packages ()
  "Install core packages to bootstrap Emacs environment."
  (interactive)
  (dolist (package init-core-packages)
    (progn (my-package-install package))))

(init-install-core-packages)

;; https://github.com/jwiegley/use-package
(eval-when-compile
  (require 'diminish)
  (require 'use-package)
  (require 'use-package-ensure))

(setq use-package-verbose t
      use-package-compute-statistics t       ;; compute stats
      use-package-always-ensure t
      use-package-minimum-reported-time 0.1) ;; carp if it takes awhile to load a package

#+end_src
** VC Install
Since Emacs 29.1, there is built-in support for [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Fetching-Package-Sources.html][installing packages]] from a /VC/
backend.  Instead of pulling in /Quelpa/, I'd like to use the built-in
functionality.  Make it look like ~(quelpa)~ as much as possible.

#+begin_src emacs-lisp
(cl-defun init-vc-install (&key (fetcher "github") repo name rev backend)
  "Install a package from a remote.
This is meant to be a thin wrapper around `package-vc-install'.  Takes
the following arguments:

- FETCHER the remote where to get the package (e.g. \"gitlab\").
  Defaults to \"github\".
- REPO is the name of the repository (e.g. \"sfromm/ip-query\").
- NAME, REV, and BACKEND are passed to `package-vc-install'."
  (interactive)
  (let* ((url (format "https://www.%s.com/%s" fetcher repo))
         (iname (when name (intern name)))
         (pkg (or iname (intern (file-name-base repo)))))
    (unless (package-installed-p pkg)
      (package-vc-install url iname rev backend))))
#+end_src

** Postamble
#+begin_src emacs-lisp

(provide 'init-elpa)
#+end_src

* Core
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/init-core.el
:END:
** Define paths
The following is meant to help keep =~.emacs.d/= tidy.  The idea is not original
and basically comes from [[https://github.com/emacscollective/no-littering][no-littering]].  Perhaps in the future I will look to
pulling this package in.

#+NAME: forge-vars
#+begin_src emacs-lisp :tangle no
(defvar forge-site-dir (expand-file-name "site-lisp/" user-emacs-directory)
  "Path to user's site configuration.")

(defvar forge-personal-dir (expand-file-name "user/" user-emacs-directory)
  "Path to user's personal configuration.")

(defvar forge-themes-dir (expand-file-name "themes/" user-emacs-directory)
  "Path to user themes.")

(defvar forge-state-dir (expand-file-name "var/" user-emacs-directory)
  "Path to Emacs' persistent data files.")

(defvar forge-backup-dir (expand-file-name "backup/" forge-state-dir)
  "Path to Emacs' backup and autosave files.")

(defvar forge-log-dir (expand-file-name "log/" forge-state-dir)
  "Path to Emacs packages' log files.")
#+end_src

#+begin_src emacs-lisp :noweb yes :tangle init.el

<<forge-vars>>
#+end_src
** Load user =custom= file
#+NAME: custom
#+begin_src emacs-lisp :tangle no
;; Load custom and then do basic initialization.
(setq custom-file (expand-file-name "custom.el" forge-personal-dir))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

#+begin_src emacs-lisp :noweb yes :tangle init.el

<<custom>>
#+end_src
** Platform helpers
#+begin_src emacs-lisp :tangle init.el
(require 'init-core)
#+end_src

#+begin_src emacs-lisp :noweb yes
;;; init-core.el --- Init Core -*- lexical-binding: t -*-
<<license>>


;;; Platform specific details.
(defun forge/system-type-darwin-p ()
  "Return non-nil if system is Darwin/MacOS."
  (string-equal system-type "darwin"))

(defun forge/system-type-windows-p ()
  "Return non-nil if system is Windows."
  (string-equal system-type "windows-nt"))

(defun forge/system-type-linux-p ()
  "Return non-nil if system is GNU/Linux."
  (string-equal system-type "gnu/linux"))

(defun forge/native-comp-p ()
  "Return non-nil native compilation is available."
  (if (fboundp 'native-comp-available-p) (native-comp-available-p)))

#+end_src
** Customization group
Create a customization group for variables specific to this configuration.

#+begin_src emacs-lisp
(defgroup forge nil
  "Forge custom settings."
  :group 'environment)
#+end_src

