emacs.org
** Configure basic behavior
Configure Emacs to use the above defined paths.  Also configure some basic
behavior, and load =custom.el= file, used by /customize/.

#+begin_src emacs-lisp

(defun init-mkdirs-user-emacs-directory ()
  "Create emacs.d directories environment."
  (dolist (dir (list forge-site-dir forge-personal-dir forge-state-dir forge-backup-dir forge-log-dir))
    (unless (file-directory-p dir)
      (make-directory dir t))))

(defun init-clean-user-emacs-directory ()
  "Set appropriate paths to keep `user-emacs-directory' clean."
  (interactive)
  (with-no-warnings
    (setq gamegrid-user-score-file-directory (expand-file-name "games" forge-state-dir)
          async-byte-compile-log-file (expand-file-name "async-bytecomp.log" forge-state-dir))
    (setopt bookmark-default-file (expand-file-name "bookmarks" forge-state-dir))
    (setopt calc-settings-file (expand-file-name "calc-settings.el" forge-state-dir))
    (setopt transient-history-file (expand-file-name "transient/history.el" forge-state-dir))
    (setopt transient-levels-file (expand-file-name "transient/levels.el" forge-personal-dir))
    (setopt transient-values-file (expand-file-name "transient/values.el" forge-personal-dir))
    (setopt message-auto-save-directory (expand-file-name "messages" forge-state-dir))
    (setopt package-quickstart-file (expand-file-name "package-quickstart.el" forge-state-dir))
    (setopt project-list-file (expand-file-name "project-list.el" forge-state-dir))
    (setopt tramp-auto-save-directory (expand-file-name "tramp/auto-save" forge-state-dir))
    (setopt tramp-persistency-file-name (expand-file-name "tramp/persistency.el" forge-state-dir))
    (setopt url-cache-directory (expand-file-name "url/cache/" forge-state-dir))
    (setopt url-configuration-directory (expand-file-name "url/configuration/" forge-state-dir))))

(init-mkdirs-user-emacs-directory)
(init-clean-user-emacs-directory)

(when (forge/native-comp-p)
  (setq native-comp-deferred-compilation nil
        native-comp-async-report-warnings-errors 'silent
        package-native-compile nil))

(add-to-list 'load-path forge-site-dir)
(add-to-list 'custom-theme-load-path forge-themes-dir)

(setopt inhibit-splash-screen t)
(setopt initial-major-mode 'org-mode)
(setopt initial-scratch-message
        (concat
         "#+TITLE: Scratch Buffer\n\n"
         "* Welcome to Emacs\n"
         "[[file:~/.emacs.d/emacs.org][emacs.org]]\n"
         "#+begin_src emacs-lisp\n"
         "#+end_src"))

(setopt visible-bell t)                 ;; set a visible bell ...
(setopt ring-bell-function #'ignore)    ;; and squash the audio bell
(setopt load-prefer-newer t)            ;; always load the newer version of a file
(setopt large-file-warning-threshold 50000000) ;; warn when opening files bigger than 50MB

(when (display-graphic-p)
  (when (forge/system-type-darwin-p)
    (setopt frame-resize-pixelwise t))  ;; allow frame resizing by pixels, instead of character dimensions
  (line-number-mode t)                ;; show line number in modeline
  (column-number-mode t)              ;; show column number in modeline
  (size-indication-mode t)            ;; show buffer size in modeline
  (tool-bar-mode -1)                  ;; disable toolbar
  (scroll-bar-mode -1)                ;; disable scroll bar
  (display-battery-mode))
#+end_src

** Minibuffer history
This keeps a record of all commands and history entered in the minibuffer.  This then allows the completion frameworks to become even more useful.

Resources:
- https://www.wisdomandwonder.com/wp-content/uploads/2014/03/C3F.html
- https://stackoverflow.com/questions/1229142/how-can-i-save-my-mini-buffer-history-in-emacs
- https://www.gnu.org/software/emacs/manual/html_node/emacs/Saving-Emacs-Sessions.html

#+begin_src emacs-lisp

(require 'savehist)
(with-eval-after-load 'savehist
  (setq savehist-file (expand-file-name "savehist" forge-state-dir)
        savehist-save-minibuffer-history 1
        savehist-additional-variables '(kill-ring search-ring regexp-search-ring))
        history-length 1000
        history-delete-duplicates t
  (add-hook 'after-init-hook #'savehist-mode))
#+end_src

** Scrolling
This is an attempt to make scrolling a bit smoother and friendlier.

#+begin_src emacs-lisp

(when (fboundp 'pixel-scroll-precision-mode)
  (pixel-scroll-precision-mode))

(setopt mouse-wheel-follow-mouse 't)         ;; scroll window under mouse
#+end_src

** Module loading and site configuration
*** Helpers to load modules from a path or directory
The following is meant to load any configuration in =forge-site-dir= or =forge-personal-dir=.

#+begin_src emacs-lisp

(defun forge/message-module-load (mod time)
  "Log message on how long it took to load module MOD from TIME."
  (message "Loaded %s (%0.2fs)" mod (float-time (time-subtract (current-time) time))))

(defun forge/load-directory-modules (path)
  "Load Lisp files in PATH directory."
  (let ((t1 (current-time)))
    (when (file-exists-p path)
      (message "Loading lisp files in %s..." path)
      (mapc 'load (directory-files path 't "^[^#\.].*el$"))
      (forge/message-module-load path t1))))

(defun forge/load-modules (&rest modules)
  "Load forge modules MODULES."
  (interactive)
  (dolist (module (cons '() modules ))
    (when module
      (let ((t1 (current-time)))
        (unless (featurep module)
          (require module nil t)
          (forge/message-module-load module t1))))))

#+end_src
*** Site configuration
Before going to much further, go ahead and load any site configuration.

#+begin_src emacs-lisp
(forge/load-directory-modules forge-site-dir)
#+end_src
** Platform-dependent configuration
The following are a couple elements that are only loaded if on MacOS or on Linux.

*** Set up PATH
#+begin_src emacs-lisp

;;; exec-path-from-shell
;;; Set exec-path based on shell PATH.
;;; Some platforms, such as MacOSX, do not get this done correctly.
(use-package exec-path-from-shell
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))

(when (forge/system-type-darwin-p)
  (dolist (path (list "/usr/local/bin" (expand-file-name "~/bin")))
    (progn
      (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
      (setenv "PATH" (concat path ":" (getenv "PATH")))
      (add-to-list 'exec-path path))))

#+end_src

*** Linux DBUS
This only has the helper function to check for network connectivity.

#+begin_src emacs-lisp

;; dbus is a linux thing -- only load on that platform
(when (eq system-type 'gnu/linux)
  (use-package dbus))
#+end_src
*** Check for network connectivity
Helper to test if there is network connectivity.  This is MacOS specific.

#+begin_src emacs-lisp

(defun macos-networksetup-status ()
  "Run networksetup to get network status."
  (let* ((output (shell-command-to-string "networksetup -listnetworkserviceorder | grep 'Hardware Port'"))
         (netsetup (split-string output "\n")))
    (catch 'found
      (dolist (elt netsetup)
        (when (> (length elt) 0)
          (let* ((netifseq (string-match "Device: \\([a-z0-9]+\\))" elt))
                 (netif (match-string 1 elt)))
            (when (string-match "status: active" (shell-command-to-string (concat "ifconfig " netif " | grep status")))
              (throw 'found netif))))))))

(defun linux-networkmanager-status ()
  "Query NetworkManager for network status."
  (let ((nm-service "org.freedesktop.NetworkManager")
        (nm-path "/org/freedesktop/NetworkManager")
        (nm-interface "org.freedesktop.NetworkManager")
        (nm-state-connected-global 70))
    (eq nm-state-connected-global
        (dbus-get-property :system nm-service nm-path nm-interface "State"))))

(defun forge/network-online-p ()
  "Check if we have a working network connection"
  (interactive)
  (when (forge/system-type-linux-p)
    (linux-networkmanager-status))
  (when (forge/system-type-darwin-p)
    (macos-networksetup-status)))
#+end_src

** Postamble
#+begin_src emacs-lisp

(provide 'init-core)
#+end_src

* Appearance
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/init-appearance.el
:END:
** Preamble
#+begin_src emacs-lisp :tangle init.el
(require 'init-appearance)
#+end_src

#+begin_src emacs-lisp  :noweb yes
;;; init-appearance.el --- Init appearance pieces -*- lexical-binding: t -*-
<<license>>

#+end_src
** Fonts
First, let's create a way to customize the font used and size.  This defines the
monospace font, the size for this font, a variable pitch font, and how much to
scale the variable pitch font compared to monospace.  Lastly, this will define
fonts to use for different unicode situations.

Resources:
- [[https://www.masteringemacs.org/article/unicode-ligatures-color-emoji][Mastering Emacs: Unicode, Ligatures, and Color Emoji]]

