emacs.org
*** Define font variables
#+begin_src emacs-lisp

(defcustom forge-font "JetBrains Mono"
  "Preferred default font."
  :type 'string
  :group 'forge)

(defcustom forge-font-size 12
  "Preferred font size."
  :type 'integer
  :group 'forge)

(defcustom forge-variable-pitch-font "Fira Sans"
  "Preferred variable pitch font."
  :type 'string
  :group 'forge)

(defcustom forge-variable-pitch-scale 1.1
  "Preferred variable pitch font."
  :type 'decimal
  :group 'forge)

(defcustom forge-unicode-font "Fira Sans"
  "Preferred Unicode font.  This takes precedence over `forge-unicode-extra-fonts'."
  :type 'string
  :group 'forge)

(defvar forge-unicode-extra-fonts
  (list "all-the-icons"
        "FontAwesome"
        "github-octicons"
        "Weather Icons")
  "List of extra Unicode fonts.")
#+end_src
*** Helper functions for configuring fonts
#+begin_src emacs-lisp
(defun my-font-name-and-size ()
  "Compute and return font name and size string."
  (interactive)
  (let* ((size (number-to-string forge-font-size))
         (name (concat forge-font "-" size)))
    (if (interactive-p) (message "Font: %s" name))
    name))

(defun font-ok-p ()
  "Is configured font valid?"
  (interactive)
  (member forge-font (font-family-list)))

(defun font-size-increase ()
  "Increase font size."
  (interactive)
  (setq forge-font-size (+ forge-font-size 1))
  (my-font-update))

(defun font-size-decrease ()
  "Decrease font size."
  (interactive)
  (setq forge-font-size (- forge-font-size 1))
  (my-font-update))

(defun my-font-update ()
  "Update font configuration."
  (interactive)
  (when (font-ok-p)
    (progn
      (message "Font: %s" (my-font-name-and-size))
      ;; (set-frame-font forge-font)
      (set-face-attribute 'default nil :family forge-font :weight 'semi-light :height (* forge-font-size 10))
      (set-face-attribute 'fixed-pitch nil :family forge-font :height 1.0)
      (when forge-variable-pitch-font
        (set-face-attribute 'variable-pitch nil :family forge-variable-pitch-font :height forge-variable-pitch-scale))
      (when (fboundp 'set-fontset-font) ;; from doom-emacs
        (dolist (font (append (list forge-unicode-font) forge-unicode-extra-fonts))
          (set-fontset-font t 'unicode (font-spec :family font) nil 'prepend))))))

(my-font-update)
#+end_src
*** All the icons
[[https://github.com/domtronn/all-the-icons.el][all-the-icons]] comes with various icons and characters to help prettify Emacs modes.

#+begin_src emacs-lisp
(use-package all-the-icons)

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))
#+end_src
*** Emojis
Emojis and emoticons.

#+begin_src emacs-lisp
(defun forge/emoji-shrug () "Shrug emoji." (interactive) (insert "¯\\_(ツ)_/¯"))
(defun forge/emoji-glare () "Glare emoji." (interactive) (insert "ಠ_ಠ"))
(defun forge/emoji-table-flip () "Table fip emoji." (interactive) (insert "(╯°□°）╯︵ ┻━┻"))

(use-package emojify
  :init (setq emojify-emojis-dir (expand-file-name "emojis" forge-state-dir)))

#+end_src
*** [[https://jblevins.org/log/rainbow-mode][Rainbow mode]] to visualize color codes.
#+begin_src emacs-lisp
(use-package rainbow-mode)
#+end_src
*** Choosing a Font
The following has been borrowed from [[https://protesilaos.com/emacs/dotemacs][Protesilaos Stavrou]] and from [[https://github.com/howardabrams/hamacs][Howard Abrams]]
and should help pick a font that is /readable/.

#+begin_example
  | Similarities | Regular                    |
  |--------------+----------------------------|
  | ()[]{}<>«»‹› | ABCDEFGHIJKLMNOPQRSTUVWXYZ |
  | 6bB8&        | abcdefghijklmnopqrstuvwxyz |
  | 0ODdoaoOQGC  | 0123456789                 |
  | I1tilIJL     | ~!@#$%^&*+                 |
  | !¡ij         | `'"‘’“”.,;:…               |
  | 5$§SsS5      | ()[]{}—-_=<>/\             |
  | 17ZzZ2       | ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ   |
  | 9gqpG6       | αβγδεζηθικλμνξοπρστυφχψω   |
  | hnmMN        |                            |
  | uvvwWuuwvy   |                            |
  | x×X          |                            |
  | .,·°%        |                            |
  | ¡!¿?         |                            |
  | :;           |                            |
  | `''"‘’“”     |                            |
  | —-~≈=≠+*_    |                            |
  | …⋯           |                            |
  | ...          |                            |
#+end_example

The following is from [[https://source-foundry.github.io/Hack/font-specimen.html][Hack's website]]:
#+begin_src c :tangle no
//  The four boxing wizards jump
#include <stdio.h> // <= quickly.
int main(int argc, char **argv) {
  long il1[]={1-2/3.4,5+6==7/8};
  int OxFaced=0xBAD||"[{(CQUINE";
  unsigned O0,l1,Z2,S5,G6,B8__XY;
  printf("@$Hamburgefo%c`",'\n');
  return ~7&8^9?0:l1|!"j->k+=*w";
}
#+end_src

** Themes
This will install a decent variety of themes to start off with something that
looks good.  It will also define a default theme to start with.

#+begin_src emacs-lisp

(defcustom forge-theme 'modus-operandi
  "Preferred graphics theme."
  :type 'symbol
  :group 'forge)

;; https://github.com/hlissner/emacs-solaire-mode
;; Encouraged by doom-themes
;; (use-package solaire-mode
;;   :disabled t)

;; https://github.com/hlissner/emacs-doom-themes
;; Something is misbehaving in doom-themes-org-config.  Comment out for now.
;; (use-package doom-themes
;;   :config
;;   (doom-themes-org-config))

;; https://github.com/dracula/emacs
(use-package dracula-theme)

;; https://github.com/fniessen/emacs-leuven-theme
(use-package leuven-theme)

;; https://github.com/cpaulik/emacs-material-theme
(use-package material-theme)

;; https://gitlab.com/protesilaos/ef-themes
(use-package ef-themes
  :custom
  (ef-themes-mixed-fonts t)
  (ef-themes-variable-pitch-ui t))

;; https://gitlab.com/protesilaos/modus-themes
(use-package modus-themes
  :custom
  (modus-themes-mixed-fonts t)
  (modus-themes-variable-pitch-ui t))

;; https://github.com/rougier/nano-theme
(use-package nano-theme)

;; https://github.com/kunalb/poet
(use-package poet-theme)

;; https://github.com/bbatsov/solarized-emacs
(use-package solarized-theme
  :custom
  (solarized-use-variable-pitch t)
  (solarized-scale-org-headlines t))

;; https://github.com/purcell/color-theme-sanityinc-tomorrow
(use-package color-theme-sanityinc-tomorrow)

;; https://github.com/ianpan870102/tron-legacy-emacs-theme
(use-package tron-legacy-theme
  :custom
  (tron-legacy-theme-vivid-cursor t)
  (tron-legacy-theme-softer-bg t))

;; https://github.com/bbatsov/zenburn-emacs
(use-package zenburn-theme
  :custom
  (zenburn-use-variable-pitch t)
  (zenburn-scale-org-headlines t))

(defun my-load-theme ()
  "Load configured forge theme."
  (when (boundp 'forge-theme)
    (load-theme forge-theme t)))

(add-hook 'after-init-hook #'my-load-theme)
#+end_src
** Modeline
At this point, I've been fairly happy with using [[https://github.com/seagle0128/doom-modeline][doom-modeline]].  I try to keep it simple.

#+begin_src emacs-lisp

;; https://github.com/seagle0128/doom-modeline
(use-package doom-modeline
  :custom
  (doom-modeline-github nil "Disable github integration")
  (doom-modeline-buffer-file-name-style 'buffer-name)
  (doom-modeline-lsp nil "Disable integration with lsp")
  (doom-modeline-workspace-name t)
  :hook
  (doom-modeline-mode . column-number-mode)
  (doom-modeline-mode . size-indication-mode)
  (after-init . doom-modeline-mode))

(use-package nyan-mode)
#+end_src
** Look and feel
#+begin_src emacs-lisp

(defun forge/setup-ui-in-daemon (frame)
  "Reload the UI in a daemon frame FRAME."
  (when (or (daemonp) (not (display-graphic-p)))
    (with-selected-frame frame
      (run-with-timer 0.1 nil #'my-font-update))))

(when (daemonp)
  (add-hook 'after-make-frame-functions #'forge/setup-ui-in-daemon))

(add-hook 'after-init-hook #'my-font-update)

#+end_src
** LIN
[[https://gitlab.com/protesilaos/lin.git][LIN]] - a utility to enhance the built-in ~hl-line-mode~ so that it better matches
the selection color in MacOS or other platforms.  See the [[https://protesilaos.com/emacs/lin][manual]].

#+begin_src emacs-lisp
(use-package lin
  :config
  (setq lin-face 'lin-mac-override-fg)
  (dolist (hook '(dired-mode-hook
                  elfeed-search-mode-hook
                  log-view-mode-hook
                  magit-log-mode-hook
                  notmuch-search-mode-hook
                  notmuch-tree-mode-hook
                  occur-mode-hook
                  org-agenda-mode-hook
                  package-menu-mode-hook))
    (add-hook hook #'lin-mode)))

#+end_src
** Postamble
#+begin_src emacs-lisp
(provide 'init-appearance)
#+end_src

* User interface elements
This section configures those pieces of Emacs where I can affect how I interact with it.  This covers a lot of ground.

#+begin_src emacs-lisp
(require 'init-ui-completion)

(require 'init-navigation)

(require 'init-ui)
#+end_src

#+begin_src emacs-lisp :tangle lisp/init-ui.el :noweb yes
;;; init-ui.el --- Init UI elements -*- lexical-binding: t -*-
;; UI here is rather broadly defined ... not just the classical one.
<<license>>

#+end_src

** Keybindings and keymaps
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/init-ui.el
:END:
