emacs.org
*** Personal keymap and leader key
This is my personal keymap, aka a Leader key, that then hooks into different commands, hydras, or other pieces.

#+begin_src emacs-lisp

(defvar-keymap my-mkhome-map
  :doc "Prefix map for mkhome targets"
  "g" #'forge-mkhome-update
  "w" #'forge-mkhome-www
  "s" #'forge-mkhome-src)

(defvar-keymap my-jump-map
  :doc "Prefix map for jumping"
  "j" #'avy-goto-char-timer
  "i" #'imenu
  "d" #'dired-jump
  "m" #'consult-bookmark
  "b" #'my-open-browser-bookmark)

(defvar-keymap my-window-map
  :doc "Prefix map for managing windows and buffers"
  :name "Windows"
  "a" #'ace-window
  "t" #'transpose-frame
  "o" #'ace-delete-other-windows
  "s" #'ace-swap-window
  "d" #'ace-delete-window
  "b" #'consult-buffer
  "g" #'golden-ratio)

(defvar-keymap my-mail-search-map
  :doc "Prefix map for searching email"
  :name "Search Email"
  "s" #'notmuch-search
  "a" #'notmuch-search-attachment
  "d" #'notmuch-search-last-day
  "w" #'notmuch-search-last-week
  "m" #'notmuch-search-last-month)

(defvar-keymap my-mail-map
  :doc "Prefix map for working with email"
  :name "Mail"
  "m" #'notmuch-cycle-notmuch-buffers
  "s" my-mail-search-map
  "O" #'forge/mail-org-notes
  "W" #'forge/notmuch-save-all-attachments
  "N" #'forge/mail-toggle-compose-new-frame)

(define-prefix-command 'forge-map)
(define-key forge-map (kbd "w") my-window-map)
(define-key forge-map (kbd "m") my-mail-map)
(define-key forge-map (kbd "h") my-mkhome-map)
(define-key forge-map (kbd "f") 'elfeed)
(define-key forge-map (kbd "j") my-jump-map)
(define-key forge-map (kbd "g") 'magit-status)
(define-key forge-map (kbd "s") 'eshell-here)
(define-key forge-map (kbd "S") 'forge/slack/body)
(define-key forge-map (kbd "t") 'org-pomodoro)
(define-key forge-map (kbd "p") 'package-list-packages)
(define-key forge-map (kbd "u") 'browse-url-at-point)
(define-key forge-map (kbd "V") 'view-mode)
(define-key forge-map (kbd "F") 'forge-focus)
(global-set-key (kbd "C-z") 'forge-map)
#+end_src
*** Hydra
#+begin_src emacs-lisp

(use-package hydra
  :demand t
  :config
  (defhydra forge/navigate (:foreign-keys run)
    "[Navigate] or q to exit."
    ("a" beginning-of-line)
    ("e" end-of-line)
    ("l" forward-char)
    ("h" backward-char)
    ("n" next-line)
    ("j" next-line)
    ("p" previous-line)
    ("k" previous-line)
    ("d" View-scroll-half-page-forward)
    ("u" View-scroll-half-page-backward)
    ("SPC" scroll-up-command)
    ("S-SPC" scroll-down-command)
    ("[" backward-page)
    ("]" forward-page)
    ("{" backward-paragraph)
    ("}" forward-paragraph)
    ("<" beginning-of-buffer)
    (">" end-of-buffer)
    ("." end-of-buffer)
    ("C-'" nil)
    ("q" nil :exit t))

  (defhydra forge/music-mpd-hydra ()
    "MPD Actions"
    ("p" mingus-toggle "Play/Pause")
    ("/" mingus-search "Search" :exit t)
    ("c" (message "Currently Playing: %s" (shell-command-to-string "mpc status")) "Currently Playing")
    ("m" mingus "Mingus" :exit t)
    ("<" (progn
           (mingus-prev)
           (message "Currently Playing: %s" (shell-command-to-string "mpc status"))) "Previous")
    (">" (progn
           (mingus-next)
           (message "Currently Playing: %s" (shell-command-to-string "mpc status"))) "Next")
    ("+" (dotimes (i 5) (mingus-vol-up)) "Louder")
    ("-" (dotimes (i 5) (mingus-vol-down)) "Quieter")
    ("q" nil "Quit"))

  (defhydra forge/music-emms-hydra ()
    "EMMS Actions"
    ("SPC" emms-pause "Play/Pause")
    ("s" emms-stop "Stop")
    ("c" emms-show "Currently Playing")
    ("m" emms "EMMS")
    ("S" emms-streams "EMMS Streams")
    ("<" emms-previous "Previous")
    (">" emms-next "Next")
    ("+" emms-volume-raise "Louder")
    ("-" emms-volume-lower "Quieter")
    ("C" emms-playlist-clear "Clear")
    ("q" nil "Quit"))

  (defhydra forge/slack (:color blue)
    ("s" slack-start "Start")
    ("i" slack-im-select "IM")
    ("g" slack-group-select "Group")
    ("c" slack-channel-select "Channel")
    ("d" slack-ws-close "Disconnect")
    ("q" nil))

  )
#+end_src
** Narrowing & Completion
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/init-ui-completion.el
:END:
#+begin_src emacs-lisp :noweb yes
;;; init-ui-completion.el --- Init UI Completion elements -*- lexical-binding: t -*-
;; UI Completion elements
<<license>>

#+end_src

*** ~which-key~ Show key bindings
[[https://github.com/justbur/emacs-which-key][which-key]] will display key bindings following your currently entered incomplete command in a popup.
For example, you can type =C-h= and it will show available completions.

#+begin_src emacs-lisp

(use-package which-key
  :custom (which-key-idle-delay 0.75)
  :demand t
  :diminish
  :config (which-key-mode))
#+end_src
*** Vertico, Orderless, & Consult
The nice thing about completion frameworks is that they support interactively narrowing a set of results.  I typically look for something that, from my perspective, integrates well with Emacs.

#+begin_src emacs-lisp

;;; Completion
;; https://github.com/minad/vertico
(use-package vertico
  :hook (after-init . vertico-mode))

;; https://github.com/oantolin/orderless
(use-package orderless
  :custom
  (completion-styles '(orderless basic)))

;; https://github.com/minad/consult
(use-package consult
  :bind
  ;; M-g go-to map
  (("M-g g" . consult-goto-line)
   ("M-g h" . consult-org-heading)
   ("M-g i" . consult-imenu)
   ;; M-s search map
   ("M-s l" . consult-line)
   ("M-s L" . consult-line-multi)
   ("M-s g" . consult-grep)
   ("M-s G" . consult-git-grep)
   ("M-s O" . consult-outline)
   ("M-s r" . consult-ripgrep)
   ("M-y" . consult-yank-pop)
   ([remap switch-to-buffer] . consult-buffer)
   ([remap switch-to-buffer-other-window] . consult-buffer-other-window)
   ([remap switch-to-buffer-other-frame] . consult-buffer-other-frame)
   ("C-c f" . consult-find))
  :config
  (setq consult-narrow-key "<"
        consult-project-root-function
        (lambda ()
          (when-let (project (project-current))
            (car (project-roots project))))))

;; https://github.com/minad/marginalia
(use-package marginalia
  :bind (:map minibuffer-local-map
              ("C-M-a" . marginalia-cycle))
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :hook (after-init . vertico-mode))
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (26605 51953 577522 0) :init (26605 51953 577484 0) :init-secs (0 0 23 0) :use-package-secs (0 0 96 0)))

*** Completion at point
[[https://github.com/minad/corfu][Corfu]] (COmpletion in Region FUnction) is an in-buffer completion with a small
completion popup.

#+begin_src emacs-lisp

(use-package corfu
  :custom
  (corfu-separator ?\s)
  :init
  (global-corfu-mode)
  :bind
  (:map corfu-map
        ("SPC" . corfu-insert-separator)
        ("C-n" . corfu-next)
        ("C-p" . corfu-previous)))

(use-package corfu-popupinfo
  :ensure nil
  :after corfu
  :hook (corfu-mode . corfu-popupinfo-mode)
  :custom
  (corfu-popupinfo-delay '(0.25 . 0.1))
  (corfu-popupinfo-hide nil)
  :config
  (corfu-popupinfo-mode))
#+end_src

Pretty icons for corfu using [[https://github.com/jdtsmith/kind-icon][kind-icon]].

#+begin_src emacs-lisp
(use-package kind-icon
  :after corfu
  :if (display-graphic-p)
  :custom
  (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src

#+begin_src emacs-lisp

(use-package emacs
  :init
  (setq tab-always-indent 'complete)
  (setq completion-cycle-threshold 3))
#+end_src

*** Completion postamble
#+begin_src emacs-lisp
(provide 'init-ui-completion)
#+end_src

** Navigation
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/init-navigation.el
:END:
#+begin_src emacs-lisp :noweb yes
;;; init-navigation.el --- Init navigation elements -*- lexical-binding: t -*-
;; Navigation elements
<<license>>

#+end_src

*** View Mode Navigation
Emacs [[https://www.gnu.org/software/emacs/manual/html_node/emacs/View-Mode.html][view-mode]].

| Key | Command     | Description                                          |
|-----+-------------+------------------------------------------------------|
| q   | ~view-quit~ | Disable view mode and switch back to previous buffer |
| e   | ~view-exit~ | Disable view mode and keep current buffer            |

#+begin_src emacs-lisp
(use-package view
  :bind
  (:map view-mode-map
        ("h" . backward-char)
        ("l" . forward-char)
        ("j" . next-line)
        ("k" . previous-line))
  :hook
  (view-mode . hl-line-mode)
  :config
  (cond ((derived-mode-p 'org-mode)
         (keymap-set view-mode-map "p" #'org-previous-visible-heading)
         (keymap-set view-mode-map "n" #'org-next-visible-heading))
        ((derived-mode-p 'elfeed-show-mode)
         (keymap-set view-mode-map "p" #'backward-paragraph)
         (keymap-set view-mode-map "n" #'forward-paragraph))
        ((derived-mode-p 'makefile-mode)
         (keymap-set view-mode-map "p" #'makefile-previous-dependency)
         (keymap-set view-mode-map "n" #'makefile-next-dependency))
        ((derived-mode-p 'emacs-lisp-mode)
         (keymap-set view-mode-map "p" #'backward-sexp)
         (keymap-set view-mode-map "n" #'forward-sexp))
        (t
         (define-key view-mode-map (kbd "p") 'scroll-down-command)
         (define-key view-mode-map (kbd "n") 'scroll-up-command))))
#+end_src
