lisp/init-ui.el


(defvar-keymap my-mkhome-map
  :doc "Prefix map for mkhome targets"
  "g" #'forge-mkhome-update
  "w" #'forge-mkhome-www
  "s" #'forge-mkhome-src)

(defvar-keymap my-jump-map
  :doc "Prefix map for jumping"
  "j" #'avy-goto-char-timer
  "i" #'imenu
  "d" #'dired-jump
  "m" #'consult-bookmark
  "b" #'my-open-browser-bookmark)

(defvar-keymap my-window-map
  :doc "Prefix map for managing windows and buffers"
  :name "Windows"
  "a" #'ace-window
  "t" #'transpose-frame
  "o" #'ace-delete-other-windows
  "s" #'ace-swap-window
  "d" #'ace-delete-window
  "b" #'consult-buffer
  "g" #'golden-ratio)

(defvar-keymap my-mail-search-map
  :doc "Prefix map for searching email"
  :name "Search Email"
  "a" #'notmuch-search-attachment
  "d" #'notmuch-search-last-day
  "w" #'notmuch-search-last-week
  "m" #'notmuch-search-last-month)

(defvar-keymap my-mail-map
  :doc "Prefix map for working with email"
  :name "Mail"
  "m" #'notmuch-cycle-notmuch-buffers
  "s" my-mail-search-map
  "O" #'forge/mail-org-notes
  "W" #'forge/notmuch-save-all-attachments
  "N" #'forge/mail-toggle-compose-new-frame)

(define-prefix-command 'forge-map)
(define-key forge-map (kbd "w") my-window-map)
(define-key forge-map (kbd "m") my-mail-map)
(define-key forge-map (kbd "h") my-mkhome-map)
(define-key forge-map (kbd "f") 'elfeed)
(define-key forge-map (kbd "j") my-jump-map)
(define-key forge-map (kbd "g") 'magit-status)
(define-key forge-map (kbd "s") 'eshell-here)
(define-key forge-map (kbd "S") 'forge/slack/body)
(define-key forge-map (kbd "t") 'org-pomodoro)
(define-key forge-map (kbd "p") 'package-list-packages)
(define-key forge-map (kbd "u") 'browse-url-at-point)
(define-key forge-map (kbd "V") 'view-mode)
(define-key forge-map (kbd "F") 'forge-focus)
(global-set-key (kbd "C-z") 'forge-map)


(use-package hydra
  :demand t
  :config
  (defhydra forge/navigate (:foreign-keys run)
    "[Navigate] or q to exit."
    ("a" beginning-of-line)
    ("e" end-of-line)
    ("l" forward-char)
    ("h" backward-char)
    ("n" next-line)
    ("j" next-line)
    ("p" previous-line)
    ("k" previous-line)
    ("d" View-scroll-half-page-forward)
    ("u" View-scroll-half-page-backward)
    ("SPC" scroll-up-command)
    ("S-SPC" scroll-down-command)
    ("[" backward-page)
    ("]" forward-page)
    ("{" backward-paragraph)
    ("}" forward-paragraph)
    ("<" beginning-of-buffer)
    (">" end-of-buffer)
    ("." end-of-buffer)
    ("C-'" nil)
    ("q" nil :exit t))

  (defhydra forge/music-mpd-hydra ()
    "MPD Actions"
    ("p" mingus-toggle "Play/Pause")
    ("/" mingus-search "Search" :exit t)
    ("c" (message "Currently Playing: %s" (shell-command-to-string "mpc status")) "Currently Playing")
    ("m" mingus "Mingus" :exit t)
    ("<" (progn
           (mingus-prev)
           (message "Currently Playing: %s" (shell-command-to-string "mpc status"))) "Previous")
    (">" (progn
           (mingus-next)
           (message "Currently Playing: %s" (shell-command-to-string "mpc status"))) "Next")
    ("+" (dotimes (i 5) (mingus-vol-up)) "Louder")
    ("-" (dotimes (i 5) (mingus-vol-down)) "Quieter")
    ("q" nil "Quit"))

  (defhydra forge/music-emms-hydra ()
    "EMMS Actions"
    ("SPC" emms-pause "Play/Pause")
    ("s" emms-stop "Stop")
    ("c" emms-show "Currently Playing")
    ("m" emms "EMMS")
    ("S" emms-streams "EMMS Streams")
    ("<" emms-previous "Previous")
    (">" emms-next "Next")
    ("+" emms-volume-raise "Louder")
    ("-" emms-volume-lower "Quieter")
    ("C" emms-playlist-clear "Clear")
    ("q" nil "Quit"))

  (defhydra forge/slack (:color blue)
    ("s" slack-start "Start")
    ("i" slack-im-select "IM")
    ("g" slack-group-select "Group")
    ("c" slack-channel-select "Channel")
    ("d" slack-ws-close "Disconnect")
    ("q" nil))

  )
