emacs.org
*** Navigation between windows: ~windmove~ and ~ace-window~
~windmove~ makes it really easy to navigate between windows.  The keys below are
based on vim and intended to keep my hand on the home row.

[[https://github.com/abo-abo/ace-window][ace-window]] makes it easy to select between multiple windows and is intended to
be as simple as ~other-window~.

#+begin_src emacs-lisp
;;; windmove
(use-package windmove
  :bind
  (("s-l" . windmove-right)
   ("s-h" . windmove-left)
   ("s-k" . windmove-up)
   ("s-j" . windmove-down))
  :custom (windmove-wrap-around t)
  :config (windmove-default-keybindings 'super))

;;; ace-window
(use-package ace-window
  :bind
  (([remap other-window] . ace-window)))
#+end_src

*** Navigation between definitions with =dumb-jump=
[[https://github.com/jacktasia/dumb-jump][dumb-jump]] is a utility to jump to a definition.  =dumb-jump= hooks into the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Xref.html][xref]]
backend to perform a search.  This can be invoked with =M-.=.

#+begin_src emacs-lisp
(use-package dumb-jump
  :commands (xref-find-definitions)
  :config
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
  ;; this requires at least xref-1.1.0, which comes with emacs-28.1 or newer
  (when (version<= "28.1" emacs-version)
    (setq xref-show-definitions-function #'xref-show-definitions-completing-read)))
#+end_src

*** Avy
[[https://github.com/abo-abo/avy][avy]] is an Emacs package for jumping to visible text using a char-based decision tree.

#+begin_src emacs-lisp
(use-package avy
  :bind ("C-;" . avy-goto-char-timer)
  :custom (avy-case-fold-search t)
  :functions (avy-setup-default)
  :config (avy-setup-default))
#+end_src

*** Navigation postamble
#+begin_src emacs-lisp
(provide 'init-navigation)
#+end_src

** Buffer & window management
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/init-ui.el
:END:
*** Tab bar
The Emacs [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Tab-Bars.html][tab bar]] provides a way to have virtual workspaces inside a single
Emacs frame.  Each tab can have its own window arrangement.  In that way, it is
similar to =eyebrowse= but is something built-in.  The table below describes
common shortcuts and commands. for int

Separately, I use the function =prot-tab--tab-bar-tabs= from Prot's [[https://gitlab.com/protesilaos/dotfiles/-/blob/master/emacs/.emacs.d/prot-lisp/prot-tab.el][prot-tab.el]]
as part of a DWIM function to switch tabs.

| Key     | Command                      | Description                    |
|---------+------------------------------+--------------------------------|
| C-x t b | ~switch-to-buffer-other-tab~ | Open a buffer in a new tab     |
| C-x t d | ~dired-other-tab~            | Open a directory in a new tab  |
| C-x t f | ~find-file-other-tab~        | Open a file in a new tab       |
| C-x t 0 | ~close-tab~                  | Close current tab              |
| C-x t 1 | ~close-tab-other~            | Close all other tabs           |
| C-x t 2 | ~tab-new~                    | Open current buffer in new tab |

#+begin_src emacs-lisp

(when (require 'tab-bar nil 'noerror)
  (tab-bar-mode)
  (setq tab-bar-close-tab-select 'recent
        tab-bar-close-button-show nil
        tab-bar-new-tab-choice 'ibuffer
        tab-bar-new-tab-to 'right
        tab-bar-position nil
        tab-bar-select-tab-modifiers '(super meta)
        tab-bar-tab-hints t
        tab-bar-show 1))

;; https://gitlab.com/protesilaos/dotfiles/-/blob/master/emacs/.emacs.d/prot-lisp/prot-tab.el
(defun prot-tab--tab-bar-tabs ()
  "Return a list of `tab-bar' tabs, minus the current one."
  (mapcar (lambda (tab)
            (alist-get 'name tab))
          (tab-bar--tabs-recent)))

(defun forge/switch-tab-dwim ()
  "Do-What-I-Mean (DWIM) switch to other tab.
This will create a new tab if no tabs exist, switch
to the other tab if there are only 2 tabs, and finally
prompt for what tab to switch to."
  (interactive)
  (let ((tabs (prot-tab--tab-bar-tabs)))
    (cond ((eq tabs nil)
           (tab-new))
          ((eq (length tabs) 1)
           (tab-next))
          (t
           (call-interactively #'tab-bar-select-tab-by-name)))))

(global-set-key (kbd "C-x t t") #'forge/switch-tab-dwim)
#+end_src

*** Window management
The =forge/window= /hydra/ defined above uses functions from [[https://github.com/abo-abo/ace-window][ace-window]] and
[[https://www.emacswiki.org/emacs/TransposeFrame][transpose-frame]].  Go ahead and pull those in for the helper functions.  I

#+begin_src emacs-lisp
(use-package transpose-frame)
#+end_src

*** Golden ratio for window sizes
[[https://github.com/roman/golden-ratio.el][golden-ratio]] mode will use the [[https://en.wikipedia.org/wiki/Golden_ratio][golden ratio]] for how to size windows.  This can
either be done as a one-off command with =golden-ratio= or a mode with
=golden-ratio-mode= where Emacs will always keep the active window as the larger
window.

This tries to specify what modes to exclude from =golden-ratio= for window sizing.

#+begin_src emacs-lisp
(use-package golden-ratio
  :hook
  (ediff-before-setup-windows . (lambda () (golden-ratio-mode -1)))
  :config
  (setq golden-ratio-exclude-modes '(messages-buffer-mode
                                     fundamental-mode
                                     ediff-mode
                                     calendar-mode
                                     calc-mode
                                     calc-trail-mode
                                     magit-popup-mode))
  (add-to-list 'golden-ratio-extra-commands 'ace-window))

#+end_src
*** Keep buffer names unique
[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Uniquify.html][Uniquify]] helps make it easier to navigate between buffers that have identically named files.

#+begin_src emacs-lisp
(with-eval-after-load 'uniquify
  (setq uniquify-buffer-name-style 'forward
        uniquify-separator "/"
        uniquify-ignore-buffers-re "^\\*"
        uniquify-after-kill-buffer-p t))
#+end_src

The next is [[https://github.com/rnkn/olivetti][olivetti]], which cleans up the window so that one can focus more on
the window contents.

#+begin_src emacs-lisp
(use-package olivetti
  :custom
  (olivetti-hide-mode-line t)
  (olivetti-body-width 80)
  :commands olivetti-mode
  :preface
  (defun forge-focus ()
    "Enable features to focus."
    (interactive)
    (olivetti-mode)))
#+end_src
*** ibuffer
#+begin_src emacs-lisp :tangle init.el
(require 'init-ibuffer)
#+end_src

#+begin_src emacs-lisp :tangle lisp/init-ibuffer.el :noweb yes
;;; init-ibuffer.el --- Init ibuffer -*- lexical-binding: t -*-
<<license>>


(use-package ibuffer
  :bind ("C-x C-b" . ibuffer)
  :preface
  (defun init-ibuffer-filters ()
    (ibuffer-switch-to-saved-filter-groups "default"))
  :hook
  (ibuffer-mode . init-ibuffer-filters)
  :custom
  (ibuffer-show-empty-filter-groups nil)
  (ibuffer-saved-filter-groups
   '(("default"
      ("Notmuch"
       (or
        (name . "\\*notmuch-")
        (mode . notmuch-search-mode)
        (mode . notmuch-show-mode)
        (mode . notmuch-message-mode)
        (mode . message-mode)))
      ("Org"
       (or
        (name . "^\\*Calendar\\*$")
        (name . "^\\*Org Agenda")
        (name . "^ \\*Agenda")
        (name . "^diary$")
        (mode . org-mode)))
      ("RANCID"
       (or
        (filename . "-rancid/")
        (mode . eos-mode)))
      ("DNS"
       (or
        (mode . dns-mode)
        (filename . "dns-zones/")))
      ("Lisp"
       (mode . emacs-lisp-mode))
      ("Dired" (mode . dired-mode))
      ("SSH"   (filename . "^/ssh:*"))
      ("Docker"
       (or
        (mode . dockerfile-mode)
        (mode . docker-compose-mode)))
      ("Magit"
       (or
        (mode . magit-status-mode)
        (mode . magit-log-mode)
        (name . "\\*magit")
        (name . "magit-")
        (name . "git-monitor")))
      ("Slack"
       (or
        (name . "^\\*Slack Log")
        (name . "^\\*Slack Event")
        (mode . slack-message-buffer-mode)
        (mode . slack-mode)))
      ("Commands"
       (or
        (mode . shell-mode)
        (mode . eshell-mode)
        (mode . term-mode)
        (mode . compilation-mode)))
      ("Emacs"
       (or
        (filename . ".emacs.d/emacs.org")
        (name . "^\\*scratch\\*$")
        (name . "^\\*Messages\\*$")
        (name . "^\\*\\(Customize\\|Help\\)")
        (name . "\\*\\(Echo\\|Minibuf\\)")))))))

(use-package ibuffer-vc
  :after (ibuffer vc)
  :bind (:map ibuffer-mode-map
              ("/ V" . ibuffer-vc-set-filter-groups-by-vc-root)))

(provide 'init-ibuffer)
#+end_src
** Postamble
#+begin_src emacs-lisp :tangle lisp/init-ui.el
(provide 'init-ui)
#+end_src

* Editing
