init.el

(require 'init-ibuffer)
