emacs.org
** General
#+begin_src emacs-lisp :tangle lisp/init-editing.el :noweb yes
;;; init-editing.el --- Init general editing support -*- lexical-binding: t -*-
<<license>>

#+end_src

#+begin_src emacs-lisp
(require 'init-editing)
#+end_src

First off, I set up some basics for all editing.  This will configure Emacs to show matching parentheses.  Secondly, it disables using tabs and requires a final newline in the file.

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(show-paren-mode)
(add-hook 'text-mode-hook 'visual-line-mode)
(setq-default indent-tabs-mode nil
              fill-column 80
              require-final-newline t)
#+end_src

This will join the next line with the current line and is inspired from the =J= command in Vim.

#+begin_src emacs-lisp :tangle lisp/init-editing.el
(defun forge/join-next-line ()
  "Join the next line with the current line."
  (interactive)
  (join-line -1))

(global-set-key (kbd "M-j") 'forge/join-next-line)
#+end_src

On [[http://endlessparentheses.com][endlessparentheses.com]], the author Artur has an [[http://endlessparentheses.com/fill-and-unfill-paragraphs-with-a-single-key.html][article]] that discusses how to fill or unfill a paragraph with one command.  This is super useful to either re-fill a paragraph or to unfill as needed.

#+begin_src emacs-lisp :tangle lisp/init-editing.el
(defun endless/fill-or-unfill ()
  "Like `fill-paragraph', but unfill if used twice."
  (interactive)
  (let ((fill-column
         (if (eq last-command 'endless/fill-or-unfill)
             (progn (setq this-command nil)
                    (point-max))
           fill-column)))
    (call-interactively #'fill-paragraph)))

(global-set-key [remap fill-paragraph] #'endless/fill-or-unfill)
#+end_src

Defined further down, pull in support for various languages.

#+begin_src emacs-lisp
(require 'init-editing-lang)
#+end_src

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el :noweb yes
;;; init-editing-lang.el --- Init support for various languages -*- lexical-binding: t -*-
<<license>>

#+end_src
** Saving files and hooks
This will save all buffers that are associated with a file.  Further, if focus switches away from
Emacs, save all files.

#+begin_src emacs-lisp :tangle lisp/init-editing.el
(defun forge/save-all ()
  "Save any file-related buffers."
  (interactive)
  (message "Saving buffers at %s" (format-time-string "%Y-%m-%dT%T"))
  (save-some-buffers t))

;; If focus switches away, save all files.
(when (version<= "24.4" emacs-version)
  (add-hook 'focus-out-hook 'forge/save-all))

#+end_src

Make all files scripts executable when saving them.

#+begin_src emacs-lisp :tangle lisp/init-editing.el
(add-hook 'after-save-hook 'executable-make-buffer-file-executable-if-script-p)
#+end_src

** Backups and Auto-Save
The goal here is to keep any backup files and save history related items located
under =~/.emacs.d/-= and not scattered across the filesystem.  Make backups
regularly.

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(setopt version-control t)        ;; number each backup file
(setopt backup-by-copying t)      ;; instead of renaming current file
(setopt delete-old-versions t)    ;; clean up after oneself
(setopt kept-new-versions 5)      ;; Number of newer versions to keep.
(setopt kept-old-versions 5)      ;; Number of older versions to keep.
(setopt trash-directory "~/.Trash")
(setq backup-directory-alist (list (cons "." forge-backup-dir))
      tramp-backup-directory-alist backup-directory-alist)

;; Turn on auto-save, so we have a fallback in case of crashes or lost data.
;; Use `recover-file' or `recover-session' to recover them.
(setopt auto-save-default t)
(setopt auto-save-timeout 120)
(setopt auto-save-interval 64)
(setq auto-save-include-big-deletions t ;; don't auto-disable auto-save after deleting large chunks
      auto-save-list-file-prefix (expand-file-name "autosave/" forge-state-dir)
      ;; handle tramp paths differently than local ones, borrowed from doom
      auto-save-file-name-transforms
      (list (list "\\`/[^/]*:\\([^/]*/\\)*\\([^/]*\\)\\'"
                  (concat auto-save-list-file-prefix "tramp-\\2") t)
            (list ".*" auto-save-list-file-prefix t)))
#+end_src

** Page breaks
Using page breaks have a couple benefits.  It can provide a nice visual
separation between sections.  It also provides a way to navigate between
sections with =C-x [= and =C-x ]= to move backward and forward within a file.

Resources:
- https://github.com/purcell/page-break-lines
- http://endlessparentheses.com/improving-page-navigation.html
- https://ericjmritz.wordpress.com/2015/08/29/using-page-breaks-in-gnu-emacs/

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(use-package page-break-lines
  :diminish page-break-lines-mode
  :hook
  (emacs-lisp-mode . page-break-lines-mode))
#+end_src
** Snippets
[[https://github.com/joaotavora/yasnippet][Yasnippet]] is a template system for Emacs.  You type in an abbreviation and
=yasnippet= will automatically expand it into function templates.

The default for =yas-snippet-dirs= is =~/.emacs.d/snippets/=.   I add to that another path that
is =~/.emacs.d/user/snippets=.

Be sure to look at the [[https://joaotavora.github.io/yasnippet/][documentation]] and the docs for [[https://joaotavora.github.io/yasnippet/snippet-development.html][writing snippets]].  Use =C-c & C-n= or =M-x yas-new-snippet= to create a new snippet.

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(use-package yasnippet
  :diminish yasnippet-minor-mode
  :init
  (yas-global-mode 1)
  :config
  (add-to-list 'yas-snippet-dirs (expand-file-name "snippets" forge-personal-dir))
  (add-hook 'term-mode-hook (lambda () "Disable yasnippet in terminal" (setq yas-dont-activate t))))
#+end_src
** Expand region semantically with =expand-region=
[[https://github.com/magnars/expand-region.el][expand-region]] to quickly expand the selected region.  Use =C-== to do so.

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(use-package expand-region
  :bind ("C-=" . er/expand-region))

#+end_src
** Display line numbers
Display line numbers any time in a programming-related buffer.

#+begin_src emacs-lisp :tangle lisp/init-editing.el

;; display-line-numbers-mode
(when (fboundp 'display-line-numbers-mode)
  (let ((linum-hooks '(csv-mode-hook prog-mode-hook yaml-mode-hook yaml-ts-mode-hook)))
    (mapc (lambda (hook) (add-hook hook 'display-line-numbers-mode)) linum-hooks))
  (setopt display-line-numbers-width 3))
#+end_src

** Highlight current line
#+begin_src emacs-lisp :tangle lisp/init-editing.el

;; hl-line-mode
(let ((hl-line-hooks '(csv-mode-hook dired-mode-hook fle-mode-hook prog-mode-hook yaml-mode-hook yaml-ts-mode-hook)))
  (mapc (lambda (hook) (add-hook hook 'hl-line-mode)) hl-line-hooks))
#+end_src
** Highlight indentation
[[https://github.com/DarthFennec/highlight-indent-guides][highlight-indent-guides]] provides a handy visual cue for indentation.

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(use-package highlight-indent-guides
  :custom (highlight-indent-guides-method 'character))
#+end_src
** Highlight whitespace
#+begin_src emacs-lisp :tangle lisp/init-editing.el
(defun my-whitespace-visualize ()
  "Enable whitespace visualizations."
  (setq highlight-tabs t)
  (setq show-trailing-whitespace t))

(let ((ws-visualize-hooks '(csv-mode-hook json-mode-hook prog-mode-hook yaml-mode-hook)))
  (mapc (lambda (hook) (add-hook hook 'my-whitespace-visualize)) ws-visualize-hooks))

#+end_src
** Delete trailing whitespace
Delete trailing whitespace when saving files.
#+begin_src emacs-lisp

;; delete-trailing-whitespace
(let ((hooks '(csv-mode-hook json-mode-hook prog-mode-hook yaml-mode-hook)))
  (mapc (lambda (hook) (add-hook hook 'delete-trailing-whitespace)) hooks))
#+end_src
** Hide Show / Folding
[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Hideshow.html][Hideshow]] minor mode allows you to selectively display portions of a document.
This includes things like folding XML sections.

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(use-package hideshow
  :diminish hs-minor-mode
  :hook ((prog-mode) . hs-minor-mode)
  :bind (("C-c h" . hs-toggle-hiding)))
#+end_src
** Finding recent files
[[https://www.emacswiki.org/emacs/RecentFiles][recentf]] will show recently opened files.  The state file is saved in =forge-state-dir=.

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(use-package recentf
  :bind ("<f7>" . consult-recent-file)
  :custom
  (recentf-save-file (expand-file-name "recentf" forge-state-dir))
  (recentf-max-menu-items 500)
  (recentf-exclude '("COMMIT_MSG" "COMMIT_EDITMSG" "/tmp" "/ssh:"))
  :init
  (recentf-mode 1))
#+end_src
** DOS to Unix
DOS and Unix have different encoding systems.  This helps make any necessary
conversions if files are coming from a DOS or Window system.  Also consider
using =set-buffer-file-coding-system= (=C-x RET f=) to /undecided-dos/ or
/undecided-unix/

See also: https://www.emacswiki.org/emacs/DosToUnix

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(defun dos2unix (buffer)
  "Do replacement of ^M characters with newlines in BUFFER."
  ;; This is basically: "M-% C-q C-m RET C-q C-j RET"
  (interactive "*b")
  (save-excursion
    (goto-char (point-min))
    (while (search-forward (string ?\C-m) nil t)
      (replace-match (string ?\C-j) nil t))))
#+end_src
** Very large files
#+begin_src emacs-lisp :tangle lisp/init-editing.el
(use-package vlf-setup
  :ensure vlf
  :init (require 'vlf-setup))

(defun ffap-vlf ()
  "Find file at point with VLF."
  (interactive)
  (let ((file (ffap-file-at-point)))
    (unless (file-exists-p file)
      (error "File does not exist: %s" file))
    (vlf file)))
#+end_src
** Managing diffs between files or previous versions of a file
*** Ediff
[[https://www.gnu.org/software/emacs/manual/html_mono/ediff.html][Ediff]] is a comprehensive interface to =diff= and =patch= utilities.

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(use-package ediff
  :init
  (setq ediff-split-window-function 'split-window-horizontally
        ediff-window-setup-function 'ediff-setup-windows-plain))
#+end_src

*** Show indicator for uncommitted differences
[[https://github.com/dgutov/diff-hl][diff-hl]] will highlight uncommitted changes on the left side of the window and
allows you to jump between changes and revert them.

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(use-package diff-hl
  :commands (diff-hl-mode diff-hl-dired-mode)
  :hook (magit-post-refresh . diff-hl-magit-post-refresh))

#+end_src

