emacs.org
** Treesitter
#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el
(defun my-treesitter-setup ()
  "Set up treesitter for use in environment."
  (interactive)
  (when (treesit-available-p)
    (setq treesit-language-source-alist
          '((bash "https://github.com/tree-sitter/tree-sitter-bash")
            ;; (cmake "https://github.com/uyha/tree-sitter-cmake")
            ;; (css "https://github.com/tree-sitter/tree-sitter-css")
            (elisp "https://github.com/Wilfred/tree-sitter-elisp")
            ;; (go "https://github.com/tree-sitter/tree-sitter-go")
            ;; (html "https://github.com/tree-sitter/tree-sitter-html")
            ;; (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
            (json "https://github.com/tree-sitter/tree-sitter-json")
            (make "https://github.com/alemuller/tree-sitter-make")
            (markdown "https://github.com/ikatyang/tree-sitter-markdown")
            (python "https://github.com/tree-sitter/tree-sitter-python")
            ;; (toml "https://github.com/tree-sitter/tree-sitter-toml")
            ;; (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
            ;; (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
            (yaml "https://github.com/ikatyang/tree-sitter-yaml")))
    (mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist))))

(use-package emacs
  :config
  (setq major-mode-remap-alist
        '((bash-mode . bash-ts-mode)
          (json-mode . json-ts-mode)
          ;; (markdown-mode . markdown-ts-mode)
          (python-mode . python-ts-mode)
          (yaml-mode . yaml-ts-mode)))
  :hook
  ((prog-mode . electric-pair-mode)))
#+end_src
** Eglot
[[https://github.com/joaotavora/eglot][Eglot]] ([[https://joaotavora.github.io/eglot/][manual]]) is an Emacs package that is a LSP client.  It is now integrated
with Emacs-29.  Alternative [[https://www.gnu.org/software/emacs/manual/html_node/eglot/index.html][manual]] link.

I find that =eglot-server-programs= is already defined by /eglot/ and the mode
one is interested is most likely defined.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el
(use-package eglot
  :ensure nil
  :commands (eglot eglot-ensure)
  :custom
  (eglot-send-changes-idle-time 0.1)
  (eglot-auto-shudown t)
  (eglot-extend-to-xref t)
  :config
  ;; (setq-default eglot-workspace-configuration
  ;;               '((:pylsp . (:configurationSources ["flake8"]
  ;;                                                  :plugins (
  ;;                                                            :pycodestyle (:enabled nil)
  ;;                                                            :mccabe (:enabled nil)
  ;;                                                            :flake8 (:enabled t))))))
  ;; (add-to-list 'eglot-server-programs
  ;;              '(python-mode . ("pylsp"))
  ;;              '(yaml-mode . ("yaml-language-server")))
  (fset #'jsonrpc--log-event #'ignore)  ; don't log every event
  :hook
  (python-mode . eglot-ensure)
  (yaml-mode . eglot-ensure))
#+end_src

The next steps are to install the language servers for those of interest.  There
is a [[https://microsoft.github.io/language-server-protocol/implementors/servers/][list]] of officially supported languages.  To install the packages, the
following is tailored for MacOS and [[https://brew.sh][Homebrew]].

#+begin_src sh
pipx install "python-lsp-server[all]"
brew install ansible-language-server
brew install bash-language-server
brew install dockerfile-language-server
brew install yaml-language-server
#+end_src

Other resources:
- https://www.adventuresinwhy.com/post/eglot/
** Virtual environments with =direnv= and ~envrc~
Use [[https://direnv.net][direnv]] and [[https://github.com/purcell/envrc][envrc]] for support of virtual environments.

#+begin_src emacs-lisp :tangle lisp/init-editing.el
(use-package envrc
  :bind (:map envrc-mode-map
              ("C-c e" . envrc-command-map))
  :hook (after-init . envrc-global-mode))
#+end_src
** Docker
[[https://github.com/spotify/dockerfile-mode][dockerfile-mode]] and [[https://github.com/meqif/docker-compose-mode][docker-compose-mode]] for editing Dockerfiles and
docker-compose files.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el

(use-package dockerfile-mode
  :mode ("Dockerfile\\'" . dockerfile-mode))

(use-package docker-compose-mode
  :mode "docker-compose.*\.yml\\'")
#+end_src
** Lisp
Go ahead and set up modes to help with editing Lisp files.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el

(use-package aggressive-indent
  :hook (emacs-lisp-mode . aggressive-indent-mode))

(with-eval-after-load 'lisp-mode
  (setq lisp-indent-offset nil))

(use-package eldoc
  :diminish eldoc-mode
  :hook
  (emacs-lisp-mode . eldoc-mode)
  (lisp-interaction-mode . eldoc-mode)
  :config
  (setq eldoc-idle-delay 0.3))
#+end_src

** Markdown
[[https://github.com/jrblevin/markdown-mode][markdown-mode]]

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el

(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :custom
  (markdown-command "pandoc -f markdown_github+smart")
  :preface
  (defun orgtbl-to-gfm (table params)
    "Convert the Orgtbl mode TABLE to GitHub Flavored Markdown."
    (let* ((alignment (mapconcat (lambda (x) (if x "|--:" "|---"))
                                 org-table-last-alignment ""))
           (params2
            (list
             :splice t
             :hline (concat alignment "|")
             :lstart "| " :lend " |" :sep " | ")))
      (orgtbl-to-generic table (org-combine-plists params2 params))))

  (defun forge/insert-org-to-md-table (table-name)
    "Helper function to create markdown and orgtbl boilerplate."
    (interactive "*sEnter table name: ")
    (insert "<!---
,#+ORGTBL: SEND " table-name " orgtbl-to-gfm

-->
<!--- BEGIN RECEIVE ORGTBL " table-name " -->
<!--- END RECEIVE ORGTBL " table-name " -->")
    (previous-line)
    (previous-line)
    (previous-line)))

#+end_src

** Python
Use [[https://github.com/proofit404/anaconda-mode][anaconda-mode]] for navigation, completion, and documentation lookup.

Set =python-shell-interpreter= to =python3=, if found in PATH,
and if =python-shell-interpreter= is the default value =python=.

#+begin_src emacs-lisp :tangle no

(use-package python
  :interpreter ("python" . python-mode)
  :config
  ;; set python-shell-interpreter to python3
  (when (and (executable-find "python3")
             (string= python-shell-interpreter "python"))
    (setq python-shell-interpreter "python3"))
  (setq-default python-indent-offset 4))
#+end_src

** Go-lang
I pull in this package for the formatting and font-lock features.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el

(use-package go-mode
  :mode "\\.go\\'"
  :config
  (add-hook 'before-save-hook #'gofmt-before-save))
#+end_src
** R & ESS
[[https://ess.r-project.org][ESS]] is a package that supports various statistical analysis programs.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el

(use-package ess)
#+end_src
** Web-related
*** web-mode
[[https://web-mode.org/][web-mode]] is a mode for editing web templates, including HTML, CSS, Jinja, and other files.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el

(use-package web-mode
  :mode ("\\.html\\'" "\\.j2\\'")
  :init
  (setq web-mode-enable-auto-indentation nil ;; temporary for now.
        web-mode-css-indent-offset 2
        web-mode-markup-indent-offset 2
        web-mode-code-indent-offset 2))

#+end_src
*** REST client
[[https://github.com/pashky/restclient.el][restclient]] enables Emacs to act as a REST client to query web services.  This
will go into =restclient-mode= if the file ends with /.http/.

See also [[http://emacsrocks.com/e15.html][Emacs Rocks: restclient-mode]] episode.

| Command   | Description                                                                       |
|-----------+-----------------------------------------------------------------------------------|
| =C-c C-c= | runs the query under the cursor, tries to pretty-print the response (if possible) |
| =C-c C-r= | same, but doesn't do anything with the response, just shows the buffer            |
| =C-c C-v= | same as `C-c C-c`, but doesn't switch focus to other window                       |
| =C-c C-p= | jump to the previous query                                                        |
| =C-c C-n= | jump to the next query                                                            |
| =C-c C-.= | mark the query under the cursor                                                   |
| =C-c C-u= | copy query under the cursor as a curl command                                     |

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el
(use-package restclient
  :mode ("\\.http\\'" . restclient-mode))

#+end_src
*** GraphQL
[[https://github.com/davazp/graphql-mode][graphql]] is a mode to edit GraphQL schema and queries.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el
(use-package graphql-mode
  :mode ("\\.graphql\\'" . graphql-mode))
#+end_src

*** PHP
This is really predominantly for syntax highlighting.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el
(use-package php-mode
  :mode "\\.php\\'")
#+end_src
** Data serialization formats
*** CSV
#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el

(use-package csv-mode)
#+end_src
*** JSON
[[https://www.json.org/][JSON]] is one data-serialization format.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el
(use-package json-mode)
#+end_src
*** YAML
[[https://yaml.org/][YAML]] is another data-serialization format.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el
(use-package yaml-mode
  :config
  (setq yaml-indent-offset 2))
#+end_src
*** XML
Just enough to help recognize XML tags and then later fold xml with
=hs-toggle-folding=.  This configures [[https://www.gnu.org/software/emacs/manual/html_node/nxml-mode/Introduction.html][nXML mode]] for viewing and editing XML
documents.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el
(with-eval-after-load 'nxml
  (defalias 'xml-mode 'nxml-mode)
  (autoload 'sgml-skip-tag-forward "sgml-mode")
  (add-to-list 'hs-special-modes-alist
               '(nxml-mode
                 "<!--\\|<[^/>]*[^/]>"
                 "-->\\|</[^/>]*[^/]>"
                 "<!--"
                 sgml-skip-tag-forward
                 nil)))
#+end_src

** Network device configurations
