lisp/init-editing.el

(use-package envrc
  :bind (:map envrc-mode-map
              ("C-c e" . envrc-command-map))
  :hook (after-init . envrc-global-mode))
