emacs.org
*** Junos
#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el

(with-eval-after-load 'junos-mode
  (add-to-list 'magic-mode-alist '("!RANCID-CONTENT-TYPE: fujitsu_1finity" . junos-mode))
  (add-to-list 'magic-mode-alist '("!RANCID-CONTENT-TYPE: juniper" . junos-mode))
  (add-to-list 'magic-mode-alist '("!RANCID-CONTENT-TYPE: junos" . junos-mode))
  (setq-local c-basic-offset 4))
#+end_src
*** EOS
#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el
(use-package eos-mode
  :ensure nil ;; install via package-vc-install
  :init (init-vc-install :fetcher "github" :repo "sfromm/eos-mode")
  :commands (eos-mode)
  :magic ("!RANCID-CONTENT-TYPE: arista" . eos-mode)
  :hook (eos-mode . highlight-indent-guides-mode))
#+end_src
*** Yang
#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el
(use-package yang-mode)
#+end_src
*** Nftables
#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el
(use-package nftables-mode)
#+end_src
** Ledger
[[https://www.ledger-cli.org/][Ledger]] and [[https://beancount.github.io/docs/index.html][beancount]] are CLI applications for double-entry accounting system.  This configures
the modes ([[https://github.com/ledger/ledger-mode][ledger]] and [[https://github.com/beancount/beancount-mode/][beancount]]) that go with them.

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el

(use-package ledger-mode
  :commands ledger-mode)

(use-package beancount
  :ensure nil
  :init (init-vc-install :fetcher "github" :repo "beancount/beancount-mode")
  :bind
  (("C-c C-n" . outline-next-visible-heading)
   ("C-c C-p" . outline-previous-visible-heading)
   ("C-c C-u" . outline-up-heading))
  :mode ("\\.beancount\\'" . beancount-mode)
  :hook (beancount-mode . outline-minor-mode))
#+end_src
** Postamble

#+begin_src emacs-lisp :tangle lisp/init-editing-lang.el

(provide 'init-editing-lang)
#+end_src

#+begin_src emacs-lisp :tangle lisp/init-editing.el

(provide 'init-editing)
#+end_src
* Applications
** Chat
#+begin_src emacs-lisp
(require 'init-chat)
#+end_src

Pull in =notifications= and =tls= for all the pieces below.

#+begin_src emacs-lisp
(require 'notifications)
(require 'tls)
#+end_src
*** IRC
IRC configuration.  As a default, use =user-login-name= as the default for
=erc-nick= and =erc-user-full-name=.

#+begin_src emacs-lisp :tangle lisp/init-chat.el :noweb yes
;;; init-chat.el --- Init chat functionality -*- lexical-binding: t -*-
<<license>>


(with-eval-after-load 'erc
  (defun sf/erc-connect ()
    "Connect to IRC via ERC"
    (interactive)
    (when (y-or-n-p "Connect to libera? ")
      (erc-tls :server "irc.libera.chat" :port 6697))
    (when (y-or-n-p "Connect to bitlbee? ")
      (progn
        (use-package bitlbee :demand t)
        (bitlbee-start)
        (sleep-for 2)
        (erc :server "localhost" :port 6667))))

  (setq erc-nick user-login-name
        erc-server "irc.libera.chat"
        erc-away-nickname (concat erc-nick "|afk")
        erc-user-full-name erc-nick
        erc-fill-column 100
        erc-fill-static-center 16
        erc-fill-function 'erc-fill-static
        erc-modules '(autojoin autoaway button completion fill irccontrols
                               list log match menu move-to-prompt netsplit
                               networks notifications readonly ring
                               services smiley spelling stamp track))

  (erc-services-mode t)

  ;; use customize for `erc-keywords', and `erc-auto-join-channels-alist'
  (setq erc-prompt (lambda () (concat "[" (buffer-name) "]"))
        erc-insert-timestamp-function 'erc-insert-timestamp-left
        erc-timestamp-format "%H:%M:%S "
        erc-kill-buffer-on-part t         ;; kill buffer after channel /part
        erc-kill-server-buffer-on-quit t  ;; kill buffer for server messages after /quit
        erc-auto-discard-away t           ;; autoaway
        erc-autoaway-use-emacs-idle t
        ;; logging
        erc-generate-log-file-name-function 'erc-generate-log-file-name-with-date
        erc-log-channels-directory (expand-file-name "erc" forge-log-dir)
        erc-log-insert-log-on-open nil
        erc-prompt-for-nickserv-password nil
        erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE"
                                  "324" "329" "333" "353" "477")
        erc-save-buffer-on-part t))
#+end_src

The following is a helper function to auto identify when using [[https://www.bitlbee.org/][BitlBee]].

#+begin_src emacs-lisp :tangle lisp/init-chat.el
(defun bitlbee-netrc-identify ()
  "Auto-identify for Bitlbee channels using authinfo or netrc.

   The entries that we look for in netrc or authinfo files have
   their 'port' set to 'bitlbee', their 'login' or 'user' set to
   the current nickname and 'server' set to the current IRC
   server's name.  A sample value that works for authenticating
   as user 'keramida' on server 'localhost' is:

   machine localhost port bitlbee login keramida password supersecret"
  (interactive)
  (when (string= (buffer-name) "&bitlbee")
    (let* ((secret (plist-get (nth 0 (auth-source-search :max 1
                                                         :host erc-server
                                                         :user (erc-current-nick)
                                                         :port "bitlbee"))
                              :secret))
           (password (if (functionp secret)
                         (funcall secret)
                       secret)))
      (erc-message "PRIVMSG" (concat (erc-default-target) " " "identify" " " password) nil))))
;; Enable the netrc authentication function for &biblbee channels.
(add-hook 'erc-join-hook 'bitlbee-netrc-identify)
#+end_src
*** Slack
There is a Slack [[https://github.com/yuya373/emacs-slack][client]] for Emacs available.  Set up is a bit convoluted.  I
sometimes use this and sometimes use the official client.  Follow the setup
instructions for getting the client id, token, and so on.

Helpful resources:

- https://github.com/yuya373/emacs-slack#how-to-get-token
- http://endlessparentheses.com/keep-your-slack-distractions-under-control-with-emacs.html?source=rss

#+begin_src emacs-lisp :tangle lisp/init-chat.el

(defvar forge-slack-client-id nil
  "Slack Client ID.")

(defvar forge-slack-client-token nil
  "Slack client token.")

(use-package slack
  :commands (slack-start)
  :bind (:map slack-mode-map
              ("C-c C-e" . slack-message-edit)
              ("C-c C-k" . slack-channel-leave)
              ("@" . slack-message-embed-mention)
              ("#" . slack-message-embed-channel))
  :init
  (setq slack-buffer-emojify t
        slack-prefer-current-team t))


#+end_src
*** Postamble
#+begin_src emacs-lisp :tangle lisp/init-chat.el
(provide 'init-chat)
#+end_src
** Directory browser and management
*** Using Dired
The following is to configure Dired.  There is some effort here to Dired to
reuse the same window & buffer.

https://writequit.org/denver-emacs/presentations/2016-05-24-elpy-and-dired.html#orgheadline11

#+begin_src emacs-lisp
(require 'init-dired)
#+end_src

#+begin_src emacs-lisp :tangle lisp/init-dired.el :noweb yes
;;; init-dired.el --- Init dired integration -*- lexical-binding: t -*-
<<license>>


(with-eval-after-load 'dired
  (diminish 'dired-omit-mode)

  (define-key global-map (kbd "C-c d") 'dired-jump)
  (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)
  (define-key dired-mode-map (kbd "Y") 'forge/dired-rsync)
  (define-key dired-mode-map (kbd "^") 'forge/dired-up)

  (defun forge/dired-mode-hook ()
    "Set misc settings in dired mode."
    (setq-local truncate-lines t))

  (defun forge/dired-up ()
    "Move up a directory without opening a new buffer."
    (interactive)
    (find-alternate-file ".."))

  (put 'dired-find-alternate-file 'disabled nil)
  (when (forge/system-type-darwin-p)
    (setq dired-use-ls-dired nil))

  (setq dired-dwim-target t
        dired-ls-F-marks-symlinks t
        dired-listing-switches "-laFh1v --group-directories-first"
        ;; -F (classify), -h (human readable), -1 (one file per line), -v (version sorting)
        dired-recursive-copies 'always
        dired-recursive-deletes 'top
        global-auto-revert-non-file-buffers t) ;; auto refresh dired buffers

  ;; This requires installing coreutils via homebrew
  (when (executable-find "gls")
    (setq insert-directory-program "gls"
          dired-use-ls-dired t)))

(setq auto-revert-verbose nil)

#+end_src

Pull in =async= for asyncrhonous operations in =dired=.

#+begin_src emacs-lisp :tangle lisp/init-dired.el
(use-package async)
(autoload 'dired-async-mode "dired-async.el" nil t)
(dired-async-mode 1)
#+end_src
*** Extra features for dired with [[https://www.gnu.org/software/emacs/manual/html_node/dired-x/][dired-x]]
#+begin_src emacs-lisp :tangle lisp/init-dired.el
(with-eval-after-load 'dired-x
  (setq dired-bind-jump nil
        dired-guess-shell-alist-user (list
                                      (list "\\.avi$" "mpv")
                                      (list "\\.doc$" "open")
                                      (list "\\.docx$" "open")
                                      (list "\\.kmz$" "open")
                                      (list "\\.mkv$" "mpv")
                                      (list "\\.mp3$" "mpv")
                                      (list "\\.mp4$" "mpv")
                                      (list "\\.mpe?g$" "mpv")
                                      (list "\\.ogg$" "mpv")
                                      (list "\\.ogm$" "mpv")
                                      (list "\\.ogv$" "mpv")
                                      (list "\\.pdf$" "open")
                                      (list "\\.webm$" "mpv")
                                      (list "\\.xls$" "open")
                                      (list "\\.xlsx$" "open")))
  (global-unset-key (kbd "C-x C-j"))
  (add-to-list 'dired-omit-extensions ".DS_Store"))
#+end_src
*** More features for dired with =dired-aux=
#+begin_src emacs-lisp :tangle lisp/init-dired.el
(with-eval-after-load 'dired-aux
  (add-to-list 'dired-compress-file-suffixes '("\\.zip\\'" ".zip" "unzip")))
#+end_src
*** Dired & Rsync
The following helper uses rsync to make file transfers quicker.  This comes from:

https://github.com/tmtxt/tmtxt-dired-async/pull/6/files

#+begin_src emacs-lisp :tangle lisp/init-dired.el
(defun forge/maybe-convert-directory-to-rsync-target (directory)
  "Adapt dired target DIRECTORY in case it is a remote target.

If directory starts with /scp: or /ssh: it is probably a tramp
target and should be converted to rsync-compatible destination
string, else we do (shell-quote-argument (expand-file-name
directory)) as is required for normal local targets acquired with
read-file-name and dired-dwim-target-directory."
  (if (or (string-prefix-p "/scp:" directory)
	  (string-prefix-p "/ssh:" directory))
      ;; - throw out the initial "/scp:" or "/ssh:"
      ;; - replace spaces with escaped spaces
      ;; - surround the whole thing with quotes
      ;; TODO: double-check that target ends with "/""
      ;; which in the case of DWIM is what we want
      (prin1-to-string
       (replace-regexp-in-string "[[:space:]]" "\\\\\\&"
	                         (substring directory 5)))
    (shell-quote-argument (expand-file-name directory))))

(defun forge/dired-rsync (dest)
  (interactive
   (list
    (expand-file-name (read-file-name "Rsync to:" (dired-dwim-target-directory)))))
  ;; store all selected files into "files" list
  (let ((files (dired-get-marked-files nil current-prefix-arg))
        ;; the rsync command
        (forge/rsync-command "rsync -arvz --progress "))
    ;; add all selected file names as arguments
    ;; to the rsync command
    (dolist (file files)
      (setq forge/rsync-command (concat forge/rsync-command (shell-quote-argument file) " ")))
    ;; append the destination
    (setq forge/rsync-command (concat forge/rsync-command (forge/maybe-convert-directory-to-rsync-target dest)))
    ;; run the async shell command
    (async-shell-command forge/rsync-command "*rsync*")
    ;; finally, switch to that window
    (other-window 1)))

#+end_src
*** Resolve [[https://syncthing.net][Syncthing]] file conflicts with [[https://github.com/ibizaman/emacs-conflict][emacs-conflict]]
See https://www.reddit.com/r/emacs/comments/bqqqra/quickly_find_syncthing_conflicts_and_resolve_them/

#+begin_src emacs-lisp :tangle lisp/init-dired.el
;;(use-package emacs-conflict :commands (emacs-conflict-show-conflicts-dired))
#+end_src
*** Disk utilization
[[https://gitlab.com/ambrevar/emacs-disk-usage][disk-usage]] is a handy utility to explore disk utilization.  On MacOS, this will require GNU coreutils.

#+begin_src emacs-lisp :tangle lisp/init-dired.el
(use-package disk-usage)
#+end_src
*** Postamble
#+begin_src emacs-lisp :tangle lisp/init-dired.el
(provide 'init-dired)
#+end_src

** Git
I use git for lots of things, but essentially to version control all kinds of
documents.  [[https://magit.vc][magit]] is a wonderful frontend to git.  Other comments:

- Pull in [[https://github.com/emacsmirror/git-timemachine][git-timemachine]] as a way to browse history in a git repository.
- I no longer use [[https://git-annex.branchable.com][git-annex]].  Here for reference.

#+begin_src emacs-lisp
(require 'init-git)
#+end_src

#+begin_src emacs-lisp :tangle lisp/init-git.el :noweb yes
;;; init-git.el --- Init git integration -*- lexical-binding: t -*-
<<license>>


(use-package magit
  :commands magit-status
  :bind ("C-x g" . magit-status)
  :custom
  (magit-push-always-verify nil)
  :init
  (setq magit-last-seen-setup-instructions "1.4.0"))

(use-package git-timemachine
  :bind ("C-x v t" . git-timemachine-toggle)
  :commands git-timemachine)

(provide 'init-git)
#+end_src

