lisp/init-editing-lang.el


(with-eval-after-load 'junos-mode
  (add-to-list 'magic-mode-alist '("!RANCID-CONTENT-TYPE: fujitsu_1finity" . junos-mode))
  (add-to-list 'magic-mode-alist '("!RANCID-CONTENT-TYPE: juniper" . junos-mode))
  (add-to-list 'magic-mode-alist '("!RANCID-CONTENT-TYPE: junos" . junos-mode))
  (setq-local c-basic-offset 4))

(use-package eos-mode
  :ensure nil ;; install via package-vc-install
  :init (init-vc-install :fetcher "github" :repo "sfromm/eos-mode")
  :commands (eos-mode)
  :magic ("!RANCID-CONTENT-TYPE: arista" . eos-mode)
  :hook (eos-mode . highlight-indent-guides-mode))

(use-package yang-mode)

(use-package nftables-mode)


(use-package fle-mode
  :ensure nil
  :init (init-vc-install :fetcher "github" :repo "sfromm/fle-mode")
  :commands (fle-mode)
  :config
  (setq-local tab-width 8))


(use-package ledger-mode
  :commands ledger-mode)

(use-package beancount
  :ensure nil
  :init (init-vc-install :fetcher "github" :repo "beancount/beancount-mode")
  :mode ("\\.beancount\\'" . beancount-mode)
  :hook (beancount-mode . outline-minor-mode))


(provide 'init-editing-lang)
