lisp/init-git.el


(use-package magit
  :commands magit-status
  :bind ("C-x g" . magit-status)
  :custom
  (magit-push-always-verify nil)
  :init
  (setq magit-last-seen-setup-instructions "1.4.0"))

(use-package git-timemachine
  :bind ("C-x v t" . git-timemachine-toggle)
  :commands git-timemachine)

(provide 'init-git)
