emacs.org
** Mail
There are several mail clients for Emacs, including the built-in ones [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Rmail.html#Rmail][Rmail]] and
[[https://www.gnu.org/software/emacs/manual/html_node/gnus/][Gnus]].  I've used both [[https://www.djcbsoftware.nl/code/mu/mu4e.html][mu4e]] and [[https://notmuchmail.org/][notmuch]].  I think both have their pros and cons.
In the end, I settled on /notmuch/.

There are basically three parts to my email configuration:

1. Fetching email
2. Composing & sending email
3. Reading and organizing email

#+begin_src emacs-lisp
(require 'init-email)
#+end_src

#+begin_src emacs-lisp :tangle lisp/init-email.el :noweb yes
;;; init-email.el --- Init email management -*- lexical-binding: t -*-
<<license>>

#+end_src

*** Fetching email
I use a couple tools to fetch my email, depending on who the service provider
is.  For those providers where I can use IMAP, I use [[http://isync.sourceforge.net/][mbsync]], aka isync, to sync
mail to my workstation.  While you can use /mbsync/ to pull mail from Gmail, I
use [[https://github.com/gauteh/lieer][lieer]] to pull and push email & labels from a Gmail account.  I recommend
reviewing the [[https://github.com/gauteh/lieer/blob/master/docs/index.md][instructions]] for more on how to setup and configure /lieer/.

I provide an example configuration for /mbsync/ to use with Gmail below.

**** Example /mbsyncrc/ configuration
A couple notes about this configuration:
- It uses a utility I have to query =auth-source= from the CLI to look up credentials.
- It stores mail in =~/.mail=.
- Recent releases of /mbsync/ use the terminology /Far/Near/ instead of /Master/Slave/.

#+begin_example
Create Both
Expunge Both
SyncState *

IMAPAccount Provider1
Host mail.example.com
User myusername
PassCmd "~/bin/auth-source-query.py myusername mail.example.com 993"
SSLType IMAPS
CertificateFile ~/.mail/.certs.pem

IMAPStore provider1-remote
Account Provider1

MaildirStore provider1-local
Path ~/.mail/Provider1/
Inbox ~/.mail/Provider1/INBOX
Flatten .

Channel provider1
Far :provider1-remote:
Near :provider1-local:
#+end_example

**** Example /lieer/ configuration
Actually, there isn't much to configure.  Again, review the instructions.  At a
high level, this is what I did.

#+begin_src sh :tangle no
git clone https://github.com/gauteh/lieer.git ~/src/lieer
pip3 install -r ~/src/lieer/requirements.txt
pushd ~/bin
ln -s ~/src/lieer/gmi gmi
popd
#+end_src

**** Example /mbsyncrc/ with Gmail
The Arch Wiki has some nice [[https://wiki.archlinux.org/index.php/Isync][information]] on configuring Isync with Gmail.  One
approach is to, by default, exclude all of the special /[Gmail]/ folders and
then include /Drafts/, /Sent Mail/, /Trash/, and /Starred/.

The following is the configuration I had when I used /mbsync/ to pull from
Gmail.  The reason I pulled out the individual channels is because I didn't want
/[Gmail]/ in the path name and this provided a way to manage that.  For example,
/[Gmail]/All Mail/ as the remote folder would become /Archive/ on my
workstation.

I'll finally note that you may need to create an [[https://support.google.com/accounts/answer/185833?hl=en][application-specific password]]
for Gmail.  Follow Google's instructions for creating the password and then
store that in your password database.

#+begin_example
IMAPAccount Gmail
Host imap.gmail.com
User myusername@gmail.com
PassCmd "~/bin/auth-source-query.py myusername imap.gmail.com 993"
SSLType IMAPS
CertificateFile ~/.mail/.certs.pem

IMAPStore gmail-remote
Account Gmail

MaildirStore gmail-local
Path ~/.mail/Gmail/
Inbox ~/.mail/Gmail/INBOX

Channel gmail-inbox
Far :gmail-remote:INBOX
Near :gmail-local:INBOX
MaxMessages 5000

Channel gmail-archive
Far :gmail-remote:"[Gmail]/All Mail"
Near :gmail-local:Archive

Channel gmail-drafts
Far :gmail-remote:"[Gmail]/Drafts"
Near :gmail-local:Drafts

Channel gmail-sent
Far :gmail-remote:"[Gmail]/Sent Mail"
Near :gmail-local:Sent

Channel gmail-trash
Far :gmail-remote:"[Gmail]/Trash"
Near :gmail-local:Trash
MaxMessages 5000

Channel gmail-flagged
Far :gmail-remote:"[Gmail]/Starred"
Near :gmail-local:flagged

Group Gmail
Channel gmail-inbox
Channel gmail-archive
Channel gmail-drafts
Channel gmail-sent
Channel gmail-trash
Channel gmail-flagged
#+end_example

The other thing of interest is that I used /MaxMessages/ to limit
how much to keep locally.  The man page says:

#+begin_quote
Sets the maximum number of messages to keep in each Slave mailbox.  This is
useful for mailboxes where you keep a complete archive on the server, but want
to mirror only the last messages (for instance, for mailing lists).
#+end_quote

*** Composing email
[[https://www.gnu.org/software/emacs/manual/html_mono/message.html][message-mode]] is the Emacs message composition mode.

Notes:
- =message-forward-as-mime= defaults to /nil/.  If set to /t/, Emacs will
  forward messages as rfc822 attachments.  When /nil/, it forwards the message
  directly inline.
- Add function =forge/mail-toggle-forward-mime= to toggle whether to forward
  inline or as MIME.

#+begin_src emacs-lisp :tangle lisp/init-email.el

(require 'message)
(with-eval-after-load 'message
  (defun forge/mail-toggle-forward-mime ()
    "Toggle whether to forward as MIME or inline."
    (interactive)
    (if (bound-and-true-p message-forward-as-mime)
        (setq message-forward-as-mime nil)
      (setq message-forward-as-mime t)))
  (setq mail-from-style 'angles
        message-kill-buffer-on-exit t
        message-forward-as-mime t
        message-citation-line-format "On %a, %Y-%m-%d at %T %z, %N wrote:"
        message-citation-line-function (quote message-insert-formatted-citation-line)
        message-make-forward-subject-function (quote message-forward-subject-fwd)
        message-signature t
        message-signature-file "~/.signature"
        message-sendmail-envelope-from 'header
        message-send-mail-function 'message-send-mail-with-sendmail)
  (add-hook 'message-mode-hook #'footnote-mode)
  (add-hook 'message-mode-hook #'turn-on-flyspell)
  (add-hook 'message-mode-hook #'yas-minor-mode)
  (add-hook 'message-mode-hook #'turn-on-auto-fill
            (lambda ()
              (turn-on-auto-fill)
              (setq fill-column 72)
              (setq mail-header-separator ""))))

(require 'mm-decode)
(with-eval-after-load 'mm-decode
  (setq mm-text-html-renderer 'shr
        mm-inline-large-images nil
        mm-inline-text-html-with-images nil
        mm-discouraged-alternatives '("text/html" "text/richtext")))
#+end_src

[[https://www.emacswiki.org/emacs/GnusAlias][gnus-alias]] provides a mechanism to switch identities when composing email with
=message-mode=.  I use =customize= to set =gnus-alias-identity-alist=

#+begin_src emacs-lisp :tangle lisp/init-email.el
(use-package gnus-alias
  :custom
  (gnus-alias-default-identity "work")
  :hook
  (message-setup . gnus-alias-determine-identity))

#+end_src

Here is an example of how =gnu-alias-identity-alist= should look.  The /extra
headers/ field can be useful if you need to add headers on the outgoing email.

#+begin_src emacs-lisp :tangle no
(setq gnus-alias-identity-alist
      '(("personal" ;; name
         nil        ;; nil
         "My Name <example@example.com>"  ;; email address
         nil        ;; organization header
         nil        ;; extra headers
         nil        ;; body text
         "~/.signature"))) ;; signature or signature file
#+end_src

[[http://gnus.org/manual/gnus_129.html][gnus-dired]] is an option for attaching files to email.

#+begin_src emacs-lisp :tangle lisp/init-email.el
(add-hook 'dired-mode #'turn-on-gnus-dired-mode)
(with-eval-after-load
    (setq gnus-dired-mail-mode 'notmuch-user-agent))
#+end_src

Sometimes it is convenient to open a new frame and compose an email there.

#+begin_src emacs-lisp :tangle lisp/init-email.el
(defun forge/mail-toggle-compose-new-frame ()
  "Toggle whether to compose email in new frame."
  (interactive)
  (let ((frame "same"))
    (if (boundp 'notmuch-mua-compose-in)
        (if (eq notmuch-mua-compose-in 'current-window)
            (progn (setq frame "new") (setq notmuch-mua-compose-in 'new-frame))
          (setq notmuch-mua-compose-in 'current-window))
      (if mu4e-compose-in-new-frame
          (setq mu4e-compose-in-new-frame nil)
        (progn (setq mu4e-compose-in-new-frame t) (setq frame "new"))))
    (message "Compose mail in %s frame" frame)))
#+end_src

**** Boxquote
Sometimes it is handy to quote text when drafting an email and boxquote does
this well.

#+begin_src emacs-lisp :tangle lisp/init-email.el
(use-package boxquote)
#+end_src

**** Functions to facilitate abuse reports
Among my responsibilities is forwarding abuse reports from other service
providers to the appropriate contact to handle.  These just make that process a
little simpler.

#+begin_src emacs-lisp :tangle lisp/init-email.el
(defun forge/mail-forward-complaint (template)
  "Forward an abuse complaint using TEMPLATE."
  (interactive)
  (if (boundp 'notmuch-mua-compose-in) (notmuch-show-forward-message) (mu4e-compose 'forward))
  (message-goto-body)
  (yas-expand-snippet (yas-lookup-snippet template))
  (message-add-header (concat "Cc: " forge-mail-abuse-poc))
  (message-goto-to))

(defun forge/mail-forward-abuse-complaint ()
  "Forward an abuse complaint to responsible party."
  (interactive)
  (forge/mail-forward-complaint "abuse-template"))

(defun forge/mail-forward-infringement-complaint ()
  "Forward a infringement complaint to responsible party."
  (interactive)
  (forge/mail-forward-complaint "infringement-template"))

(defun forge/mail-forward-spam-complaint ()
  "Forward a spam complaint to responsible party."
  (interactive)
  (forge/mail-forward-complaint "spam-template"))

(defun forge/mail-forward-compromised-complaint ()
  "Forward a compromised account report to responsible party."
  (interactive)
  (forge/mail-forward-complaint "compromise-template"))

(defun forge/mail-reply-to-abuse ()
  "Set Reply-To header to Abuse POC."
  (interactive)
  (message-add-header (concat "Reply-To: " forge-mail-abuse-poc)))

(defun forge/mail-reply-to-noc ()
  "Set Reply-To header to NOC POC."
  (interactive)
  (message-add-header (concat "Reply-To: " forge-mail-noc-poc)))

(defun forge/mail-org-notes ()
  "Send org notes as an email."
  (interactive)
  (when (eq major-mode 'org-mode)
    (org-mime-org-subtree-htmlize)
    (message-goto-to)))
#+end_src

