init.el

(require 'init-email)
