emacs.org
**** Email hydra
#+begin_src emacs-lisp :tangle lisp/init-email.el
(defhydra forge/hydra-email (:color blue)
  "

  _A_ Forward Abuse report  _S_  Forward Spam report  _N_  Toggle compose New frame
  _I_ Forward Infringement  _C_  Comporomised report  _W_  Save all attachments
  _sd_ Search last day      _sw_ Search last week     _sm_ Search last month
  _ra_ Reply to Abuse POC   _rn_ Reply to NOC POC     _O_ Email Org notes
  "
  ("A" forge/mail-forward-abuse-complaint)
  ("ra" forge/mail-reply-to-abuse)
  ("rn" forge/mail-reply-to-noc)
  ("sd" notmuch-search-last-day)
  ("sw" notmuch-search-last-week)
  ("sm" notmuch-search-last-month)
  ("O" forge/mail-org-notes)
  ("I" forge/mail-forward-infringement-complaint)
  ("S" forge/mail-forward-spam-complaint)
  ("C" forge/mail-forward-compromised-complaint)
  ("W" forge/notmuch-save-all-attachments)
  ("N" forge/mail-toggle-compose-new-frame))

(global-set-key (kbd "C-c m") 'forge/hydra-email/body)

#+end_src

*** Sending email
Historically, I used [[https://www.gnu.org/software/emacs/manual/html_node/smtpmail/Emacs-Speaks-SMTP.html][smtpmail]] to send email.  If you are online most, if not
all, the time, this works well enough.  =smtpmail= will block Emacs while it is
going through the /SMTP/ process, but this is usually very brief.  Another
alternative is to use [[https://marlam.de/msmtp/][msmtp]] to mail queuing if offline.  You need to make sure
that =auth-source= has credentials to perform /SMTP AUTH/.

In my case, I wrote my own utility to perform the SMTP exchange.  This is
because some mail providers will require /XOAUTH2/ authentication and the native
tools were not in a place to support this.

#+begin_src emacs-lisp :tangle lisp/init-email.el
(with-eval-after-load 'sendmail
  (setq mail-specify-envelope-from t
        mail-envelope-from 'header
        sendmail-program (executable-find "sendmail.py")))
#+end_src

Here is an example of my deprecated =smtpmail= configuration.

#+begin_src emacs-lisp :tangle lisp/init-email.el
(use-package smtpmail
  :disabled t
  :config
  (setq smtpmail-stream-type 'ssl
        smtpmail-default-smtp-server forge-smtp-server-work
        smtpmail-smtp-server forge-smtp-server-work
        smtpmail-smtp-service 465
        smtpmail-smtp-user forge-smtp-user-work
        smtpmail-queue-dir (expand-file-name "queue" forge-state-dir)))
#+end_src

*** Signing and Encryption
This configures Emacs Message Mode [[https://www.gnu.org/software/emacs/manual/html_node/message/Security.html][security]] settings.  The key points are to
always encrypt to self and to list the OpenPGP keys that I will sign with.

- =C-c C-m s s= Sign current message with S/MIME.
- =C-c C-m s o= Sign current message with PGP.
- =C-c C-m s p= Sign current message with PGP/MIME.
- =C-c RET C-c= Encrypt current message.
- =C-c C-m c s= Encrypt current message using S/MIME.
- =C-c C-m c o= Encrypt current message using PGP.
- =C-c C-m c p= Encrypt current message using PGP/MIME.

#+begin_src emacs-lisp :tangle lisp/init-email.el
(with-eval-after-load 'mml-sec
  (setq mml-secure-openpgp-encrypt-to-self t
        mml-secure-openpgp-sign-with-sender t
        mml-secure-smime-encrypt-to-self t
        mml-secure-smime-sign-with-sender t)
  (add-to-list 'mml-secure-openpgp-signers "A852499F"))
#+end_src

*** Notmuch base configuration
Before I get into how I have Emacs configured to work with /notmuch/, the
following gives an idea of how I configure /notmuch/ itself.  You will want to
run =notmuch setup= first, which will create =~/.notmuch-config=.

The important part from my configuration is the option =new.tags= which is the
default tag applied to all messages incorporated by =notmuch new=.

#+begin_example
#	tags	A list (separated by ';') of the tags that will be
#		added to all messages incorporated by "notmuch new".
[new]
tags=new
#+end_example

I then have two [[https://notmuchmail.org/manpages/notmuch-hooks-5/][hooks]] configured for notmuch.  The general flow when you run =notmuch new= is:

1. Run the /pre/ hook.
2. Notmuch then indexes your email.
3. Run the /post/ hook.

The following are just examples of hooks.  The first is the /pre/ hook to fetch email.

#+begin_src sh :tangle no :shebang #!/bin/bash
# The pre-new hook
echo -e "---\nStart $(date)."
mbsync -a
exit 0
#+end_src

The next hook to run is the /post/ hook, which will tag my email.

#+BEGIN_SRC sh :tangle no :shebang #!/bin/bash
# The post-new hook
notmuch tag --batch <<EOF
+inbox                  -- folder:Work/INBOX or folder:Personal/INBOX
-inbox                  -- not ( folder:Personal/INBOX or folder:Work/INBOX )
+sent                   -- folder:Personal/Sent or folder:Work/Sent
+bulk                   -- folder:Work/Spam or folder:Work/incoming
-bulk                   -- not ( folder:Work/Spam or folder:Work/incoming or folder:Work/Trash )
+trash -archive -inbox  -- folder:Personal/Trash or folder:Work/Trash
#
+invite                 -- mimetype:text/calendar
#
-new -- tag:new
EOF

echo -e "Done at $(date)."
exit
#+END_SRC
