lisp/init-email.el

(defhydra forge/hydra-email (:color blue)
  "

  _A_ Forward Abuse report  _S_  Forward Spam report  _N_  Toggle compose New frame
  _I_ Forward Infringement  _C_  Comporomised report  _W_  Save all attachments
  _sd_ Search last day      _sw_ Search last week     _sm_ Search last month
  _ra_ Reply to Abuse POC   _rn_ Reply to NOC POC     _O_ Email Org notes
  "
  ("A" forge/mail-forward-abuse-complaint)
  ("ra" forge/mail-reply-to-abuse)
  ("rn" forge/mail-reply-to-noc)
  ("sd" notmuch-search-last-day)
  ("sw" notmuch-search-last-week)
  ("sm" notmuch-search-last-month)
  ("O" forge/mail-org-notes)
  ("I" forge/mail-forward-infringement-complaint)
  ("S" forge/mail-forward-spam-complaint)
  ("C" forge/mail-forward-compromised-complaint)
  ("W" forge/notmuch-save-all-attachments)
  ("N" forge/mail-toggle-compose-new-frame))

(global-set-key (kbd "C-c m") 'forge/hydra-email/body)

(with-eval-after-load 'sendmail
  (setq mail-specify-envelope-from t
        mail-envelope-from 'header
        sendmail-program (executable-find "sendmail.py")))

(use-package smtpmail
  :disabled t
  :config
  (setq smtpmail-stream-type 'ssl
        smtpmail-default-smtp-server forge-smtp-server-work
        smtpmail-smtp-server forge-smtp-server-work
        smtpmail-smtp-service 465
        smtpmail-smtp-user forge-smtp-user-work
        smtpmail-queue-dir (expand-file-name "queue" forge-state-dir)))

(with-eval-after-load 'mml-sec
  (setq mml-secure-openpgp-encrypt-to-self t
        mml-secure-openpgp-sign-with-sender t
        mml-secure-smime-encrypt-to-self t
        mml-secure-smime-sign-with-sender t)
  (add-to-list 'mml-secure-openpgp-signers "A852499F"))
