emacs.org
*** Org
I pull in Org with all of the contributed packages via the /org-plus-contrib/
package via the Org ELPA package repository.

Miscellaneous notes:
- [[https://orgmode.org/manual/Column-View.html#Column-View][Column View]] is a way to view the outline tree in a column view.  This
  configures the default column view using =org-columns-default-format=.  You
  can then turn on column view with =C-c C-x C-c=.  In column view, =g= will
  refresh and =q= will exit. You can also optionally also [[https://orgmode.org/manual/Scope-of-column-definitions.html#Scope-of-column-definitions][define]] different columns
  in an outline's =PROPERTIES=.
#+begin_example
:PROPERTIES:
:COLUMNS: %25ITEM %TAGS %PRIORITY %TODO
:END:
#+end_example
- [[https://orgmode.org/manual/Initial-visibility.html][Initial visibility]] can be managed using the =org-startup-folded= variable and
  on a per-file basis with /#+STARTUP:/ in the file.  Allowed values are
  /overview/, /content/, /showall/, and /showeverything/.  I've modified the
  default from /showeverything/ to /content/ so that it shows all headings when
  first visiting a file.
- =org-tags-exclude-from-inheritance= to enumerate tags that should not be
  inherited. See also /org-crypt/.
- Use =org-reverse-note-order= to refile items to the top of a document.
- For =org-timer-set-timer=, use =C-c-C-x ;=.  The timer is set to 25 minutes.
  This has taken the place of /org-pomodoro/.  See [[https://orgmode.org/manual/Timers.html][Org timers]].

#+begin_src emacs-lisp
(require 'init-org)
#+end_src

#+begin_src emacs-lisp :tangle lisp/init-org.el :noweb yes
;;; init-org.el --- Init orgmode -*- lexical-binding: t -*-
<<license>>


(use-package org
  :preface
  (defun my-org-mode-hook ()
    "Turn on settings for org-mode."
    (interactive)
    (when (fboundp 'turn-off-auto-fill)
      (turn-off-auto-fill))
    (when (fboundp 'turn-on-flyspell)
      (turn-on-flyspell)))

  (defun init-my-org-agenda ()
    "Initialze org-agenda configuration."
    (interactive)
    (setq org-agenda-skip-scheduled-if-deadline-is-shown t
          org-agenda-sticky t
          org-agenda-hide-tags-regexp "."
          org-agenda-restore-windows-after-quit t
          org-agenda-window-setup 'current-window
          org-agenda-compact-blocks nil
          org-agenda-files
          (list (concat org-directory "/inbox.org")
                (concat org-directory "/agenda.org")
                (concat org-directory "/journal.org")
                (concat org-directory "/work.org")
                (concat org-directory "/personal.org"))
          org-agenda-prefix-format
          '((agenda . " %i %-12:c%?-12t% s")
            (todo   . " %i %-12:c")
            (tags   . " %i %-12:c")
            (search . " %i %-12:c")))
    ;; There's a lot to org-agenda-custom-commands
    ;; For type:
    ;;   type     The command type, any of the following symbols:
    ;;     agenda      The daily/weekly agenda.
    ;;     todo        Entries with a specific TODO keyword, in all agenda files.
    ;;     search      Entries containing search words entry or headline.
    ;;     tags        Tags/Property/TODO match in all agenda files.
    ;;     tags-todo   Tags/P/T match in all agenda files, TODO entries only.
    ;;     todo-tree   Sparse tree of specific TODO keyword in *current* file.
    ;;     tags-tree   Sparse tree with all tags matches in *current* file.
    ;;     occur-tree  Occur sparse tree for *current* file.
    (setq org-agenda-custom-commands
          '(("2" "Next two weeks"
             ((agenda ""
                      ((org-agenda-start-on-weekday nil)
                       ;; (org-agenda-start-day "+1d")
                       (org-agenda-span 14)
                       (org-deadline-warning-days 0)
                       (org-agenda-block-separator nil)
                       (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                       (org-agenda-overriding-header "\n📅 Next 14 days\n")))))
            ("g" "Overview"
             ((agenda ""
                      ((org-agenda-overriding-header "🕐 Today\n")
                       (org-agenda-span 1)
                       (org-deadline-warning-days 0)
                       (org-agenda-day-face-function (lambda (date) 'org-agenda-date))
                       (org-agenda-block-separator nil)))
              (agenda ""
                      ((org-agenda-start-on-weekday nil)
                       (org-agenda-start-day "+1d")
                       (org-agenda-span 'week)
                       (org-deadline-warning-days 0)
                       (org-agenda-block-separator nil)
                       (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                       (org-agenda-overriding-header "\n📅 Next 7 days\n")))
              (tags-todo "inbox"
                         ((org-agenda-prefix-format "  %?-12t% s")
                          (org-agenda-block-separator nil)
                          (org-agenda-overriding-header "\n📥 Inbox\n")))
              (agenda ""
                      ((org-agenda-time-grid nil)
                       (org-agenda-start-on-weekday nil)
                       ;; We don't want to replicate the previous section's
                       ;; three days, so we start counting from the day after.
                       (org-agenda-start-day "+3d")
                       (org-agenda-span 14)
                       (org-agenda-show-all-dates nil)
                       (org-deadline-warning-days 0)
                       (org-agenda-block-separator nil)
                       (org-agenda-entry-types '(:deadline))
                       (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                       (org-agenda-overriding-header "\n🞜 Upcoming deadlines (+14d)\n")))
              (todo "NEXT"
                    ((org-agenda-skip-function '(org-agenda-skip-entry-if 'deadline))
                     (org-agenda-prefix-format "  %i %-12:c [%e] ")
                     (org-agenda-block-separator nil)
                     (org-agenda-overriding-header "\nNext\n")))
              (todo "WAITING"
                    ((org-agenda-skip-function '(org-agenda-skip-entry-if 'deadline))
                     (org-agenda-prefix-format "  %i %-12:c [%e] ")
                     (org-agenda-block-separator nil)
                     (org-agenda-overriding-header "\n💤 Waiting\n")))
              (todo "PROJECT"
                    ((org-agenda-skip-function '(org-agenda-skip-entry-if 'deadline))
                     (org-agenda-prefix-format "  %i %-12:c [%e] ")
                     (org-agenda-block-separator nil)
                     (org-agenda-overriding-header "\n🚧 Projects\n")))
              (tags-todo "SOMEDAY"
                         ((org-agenda-skip-function '(org-agenda-skip-entry-if 'deadline))
                          (org-agenda-prefix-format "  %i %-12:c [%e] ")
                          (org-agenda-block-separator nil)
                          (org-agenda-overriding-header "\n💤 Someday\n")))
              (tags "CLOSED>=\"<-10d>\""
                    ((org-agenda-overriding-header "\n✓ Completed last 10 days\n"))))))))

  (defun init-my-org-capture-templates ()
    "Set up org-capture-templates."
    (interactive)
    ;; For template expansion,
    ;; see https://orgmode.org/manual/Template-expansion.html#Template-expansion
    (setq org-capture-templates
          `(("i" "Inbox" entry
             (file "inbox.org")
             "* TODO %? \n:PROPERTIES:\n:CAPTURED:  %U\n:END:\nReference: %a\n")
            ("c" "Calendar invite" entry
             (file "inbox.org")
             (function notmuch-calendar-capture-event)
             :prepend t)
            ("n" "Meeting notes" entry
             (file+olp+datetree "journal.org")
             "* Notes - %a \n:PROPERTIES:\n:CAPTURED:  %U\n:END:\n%U\nAttendees:\n\nAgenda:\n\nDiscussion:\n"
             :clock-in t
             :clock-resume t)
            ("j" "Journal" entry
             (file+olp+datetree "journal.org")
             "* %?\n%U\n"
             :clock-in t
             :clock-resume t)
            ("b" "Bookmark" entry
             (file+headline "notebook.org" "Unfiled")
             "* %^L %^g \n:PROPERTIES:\n:CAPTURED: %U\n:END:\n\n"
             :prepend t)

            ("l" "Log")
            ("ll" "Log" entry
             (file+olp+datetree "journal.org")
             "* %U - %?\n")
            ("lr" "Radio log" entry
             (file+olp+datetree "journal.org")
             "* %U - %^{LOCATION|QTH}p %? :RADIO:\n#+begin_src fle\n%(fle-init-log--contents)\n#+end_src"
             )

            ("r" "Reference")
            ("rm" "Music" entry
             (file+olp+datetree "journal.org")
             "* %(forge/capture-current-song) :music:\n%U\n")
            ("rr" "Reference" entry
             (file+olp+datetree "articles.org")
             "* %a %?\n:PROPERTIES:\n:CAPTURED:  %U\n:END:\n"
             :prepend t)
            ("rw" "Web Page" entry
             (file+olp+datetree "articles.org")
             (function my-org-clip-web-page)
             :prepend t)
            ("rf" "Elfeed/News Article" entry
             (file+olp+datetree "articles.org")
             "* %a %? :%(forge/elfeed-get-entry-tags):ARTICLE:\n:PROPERTIES:\n:URL:  %(forge/elfeed-capture-entry-url)\n:CAPTURED:  %U\n:END:\n"
             :prepend t))))

  (defun my-org-goto-journal-entry (date)
    "Go to specified journal entry for DATE and narrow to subtree."
    (interactive (list (org-read-date)))
    (let* ((date-list (org-date-to-gregorian date))
           (year (number-to-string (nth 2 date-list))))
      (find-file (expand-file-name "journal.org" org-directory))
      (widen)
      (org-datetree-find-date-create date-list)))

  (defun my-org-goto-relative-journal-entry (offset)
    "Go to a relative date's journal entry in the datetree and narrow to subtree."
    (interactive "Enter date offset (e.g., +3, fri, +2tue): ")
    (let ((date (org-read-date nil nil offset)))
      (my-org-goto-journal-entry date)))

  (defun my-org-goto-yesterday-journal-entry ()
    "Go to yesterday's journal entry in the datetree and narrow to subtree."
    (interactive)
    (my-org-goto-relative-journal-entry "-1"))

  (defun my-org-goto-tomorrow-journal-entry ()
    "Go to tomorrow's journal entry in the datetree and narrow to subtree."
    (interactive)
    (my-org-goto-relative-journal-entry "+1"))

  (defun my-org-init-hook ()
    "Set up defaults after org.el has been loaded."
    (init-my-org-agenda)
    (init-my-org-capture-templates))

  (defun my-org-fixed-font-faces ()
    "Keep the following with fixed-pitch fonts."
    (interactive)
    (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-block nil :inherit 'fixed-pitch))

  (defun my-tangle-org-mode-on-save ()
    "Tangle org-mode file when saving -- but not org archive files."
    (when (string= (message "%s" major-mode) "org-mode")
      (unless (string-suffix-p ".org_archive" buffer-file-name)
        (org-babel-tangle))))

  (defun my-org-set-property (property value)
    "Set arbitrary PROPERTY to VALUE for current heading."
    (org-back-to-heading)
    (when (not (org-element-property :CREATED (org-element-at-point)))
      (org-set-property property value)))

  (defun my-org-set-uuid ()
    "Set ID property for current headline."
    (interactive)
    (my-org-set-property "ID" (org-id-uuid)))

  (defun my-org-set-created ()
    "Set CREATED property for current headline."
    (interactive)
    (my-org-set-property "CREATED" (with-temp-buffer (org-insert-time-stamp (current-time) t t))))

  (defun my-org-timer-clock-in ()
    "Clock in when starting a org-timer."
    (if (eq major-mode 'org-agenda-mode)
        (call-interactively 'org-agenda-clock-in)
      (call-interactively 'org-clock-in)))

  (defun my-org-timer-clock-out ()
    "Clock in when starting a org-timer."
    (if (eq major-mode 'org-agenda-mode)
        (call-interactively 'org-agenda-clock-out)
      (call-interactively 'org-clock-out)))

  (defun my-org-set-properties ()
    "Set stock org properties for current headline."
    (interactive)
    (my-org-set-uuid)
    (my-org-set-created))

  (defun my-org-clip-web-page ()
    "Clip web page for org capture."
    (interactive)
    (when (derived-mode-p 'eww-mode)
      (require 'ol-eww)
      (org-eww-copy-for-org-mode)
      (concat
       "* %a %? :ARTICLE:
  :PROPERTIES:
  :CREATED:  %U
  :URL:      " (eww-current-url) "
  :END:\n\n" (car kill-ring))))


  :hook
  ((org-mode . my-org-mode-hook)
   (after-init . my-org-init-hook)
   (after-save . my-tangle-org-mode-on-save)
   (org-timer-set . my-org-timer-clock-in)
   (org-timer-done . my-org-timer-clock-out)
   (org-timer-stop . my-org-timer-clock-out)
   (org-mode . variable-pitch-mode))

  :custom
  (org-attach-id-dir "~/annex/org/data/")
  (org-directory "~/forge")
  (org-attach-method 'mv)
  (org-babel-python-command "python3")
  (org-catch-invisible-edits 'smart)
  (org-clock-display-default-range 'thisweek)
  (org-clock-in-resume t)
  (org-clock-out-remove-zero-time-clocks t)
  (org-clock-persist t)
  (org-clock-sound (expand-file-name "drip.ogg" "~/annex/Music/"))
  (org-confirm-babel-evaluate nil)
  (org-default-notes-file (expand-file-name "journal.org" org-directory))
  (org-ellipsis "⤵")
  (org-export-allow-bind-keywords t)
  (org-export-backends '(ascii html icalendar latex md))
  (org-export-coding-system 'utf-8)
  (org-html-checkbox-type 'html)
  (org-list-allow-alphabetical t)
  (org-log-done t)
  (org-log-reschedule "note")
  (org-log-into-drawer t)
  (org-outline-path-complete-in-steps nil)
  (org-persist-directory (expand-file-name "org-persist" forge-state-dir))
  (org-refile-use-outline-path 'file)
  (org-refile-targets '(("inbox.org" :maxlevel . 2)
                        ("agenda.org" :maxlevel . 3)
                        ("articles.org" :maxlevel . 3)
                        ("notebook.org" :maxlevel . 5)
                        ("work.org" :maxlevel . 5)
                        ("personal.org" :maxlevel . 5)
                        (nil :maxlevel . 2)))
  (org-reverse-note-order t)
  (org-src-fontify-natively t)
  (org-startup-indented t)
  (org-startup-folded 'content)
  (org-timer-default-timer 25)
  (org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+") ("1." . "a.")))

  :bind
  (("<f8>" . org-cycle-agenda-files)
   ("<f12>" . org-agenda)
   ("C-c l" . org-store-link)
   ("C-c c" . org-capture)
   ("C-c a" . org-agenda)
   ("C-c b" . org-switchb))
  (:map org-mode-map
        ("M-q" . endless/fill-or-unfill)
        ("RET" . org-return))

  :init
  (setq org-file-apps
        '((auto-mode . emacs)
          ("\\.doc\\'" . "open %s")
          ("\\.docx\\'" . "open %s")
          ("\\.xlsx\\'" . "open %s")
          ("\\.pptx\\'" . "open %s")
          ("\\.pdf\\'" . default)))
  (setq org-structure-template-alist
        '(("a" . "export ascii")
          ("c" . "center")
          ("C" . "comment")
          ("e" . "example")
          ("E" . "export")
          ("h" . "export html")
          ("l" . "src emacs-lisp")
          ("m" . "export md")
          ("p" . "src python")
          ("q" . "quote")
          ("s" . "src")
          ("v" . "verse")
          ("y" . "src yaml")))

  ;; Workflow states
  ;; https://orgmode.org/manual/Workflow-states.html#Workflow-states
  (setq org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "WAITING(w)" "SOMEDAY(m)" "|" "DONE(d)" "DELEGATED(l)" "CANCELLED(c)")
                            (sequence "PROJECT" "|" "DONE(d)")
                            (sequence "|" "MEETING" "REFERENCE(r)")))
  ;; List of tags that should never be inherited.
  (setq org-tags-exclude-from-inheritance '("crypt"))
  ;;
  (setq org-columns-default-format "%50ITEM(Task) %2PRIORITY %10Effort(Effort){:} %10CLOCKSUM"
        org-modules '(org-id ol-eww ol-docview ol-info ol-irc org-habit)
        org-src-preserve-indentation t
        org-src-window-setup 'current-window                    ;; use current window when editing a source block
        org-cycle-separator-lines 2                             ;; leave this many empty lines in collapsed view
        org-table-export-default-format "orgtbl-to-csv"         ;; export tables as CSV instead of tab-delineated
        org-publish-project-alist '(("public"
                                     :base-directory "~/forge"
                                     :publishing-directory "~/Documents")))

  )



(with-eval-after-load 'org
  ;; (forge/org-fixed-font-faces)
  ;; (org-load-modules-maybe t)
  (org-babel-do-load-languages 'org-babel-load-languages '((ditaa . t)
                                                           (dot . t)
                                                           (emacs-lisp . t)
                                                           (org . t)
                                                           (perl . t)
                                                           (python . t)
                                                           (ruby . t)
                                                           (shell . t)
                                                           (calc . t))))
#+end_src
