emacs.org
*** Org Contacts, Notmuch and mail
#+begin_src emacs-lisp :tangle lisp/init-org.el
(use-package ol-notmuch
  :after (:any org notmuch))
#+end_src

=org-mime= allows one to use Org formatting for email.

#+begin_src emacs-lisp :tangle lisp/init-org.el
(use-package org-mime
  :config
  (add-hook 'message-mode-hook
            (lambda ()
              (local-set-key "\C-c\M-o" 'org-mime-htmlize)))
  (add-hook 'org-mode-hook
            (lambda ()
              (local-set-key "\C-c\M-o" 'org-mime-org-buffer-htmlize)))
  :init
  (setq org-mime-export-options '(:section-numbers nil :with-author nil :with-toc nil)))
#+end_src

#+begin_src emacs-lisp :tangle lisp/init-org.el
(use-package org-contacts
  :after org
  :config
  (setq org-contacts-files (list  "~/forge/contacts.org"))
  (add-to-list 'org-capture-templates
               '("C" "Contacts" entry
                 (file "~/forge/contacts.org")
                 "* %(org-contacts-template-name)\n:PROPERTIES:\n:EMAIL: %(org-contacts-template-email)\n:PHONE:\n:ADDRESS:\n:BIRTHDAY:\n:END:")))
#+end_src
*** Presentations with =org-tree-slide=
#+begin_src emacs-lisp :tangle lisp/init-org.el
(use-package org-tree-slide
  :bind (:map org-tree-slide-mode-map
              ("<f8>" . org-tree-slide-mode)
              ("<f9>" . org-tree-slide-move-previous-tree)
              ("<f10>" . org-tree-slide-move-next-tree)
              ("C-,"  . org-tree-slide-move-previous-tree)
              ("C-." . org-tree-slide-move-next-tree))
  :init
  (setq org-tree-slide-skip-outline-level 4))

#+end_src
*** Presentations with =org-reveal=
See: https://github.com/yjwen/org-reveal/

#+begin_src emacs-lisp :tangle lisp/init-org.el
(use-package ox-reveal)
#+end_src
*** Org Agenda and Holidays
Configure the holidays package and what holidays to show or not show.

#+begin_src emacs-lisp :tangle lisp/init-org.el
(use-package holidays
  :defer t
  :ensure nil
  :custom
  (holiday-bahai-holidays nil)
  (holiday-other-holidays
   '((holiday-fixed 6 19 "Juneteenth"))
   ))
#+end_src

You can then integrate display of holidays in /Org Agenda/ with the following:

#+begin_src org
,* Holidays
:PROPERTIES:
:CATEGORY: Holiday
:END:
%%(org-calendar-holiday)

#+end_src
*** Org Crypt
[[https://orgmode.org/manual/Org-Crypt.html][Org Crypt]] encrypts the text of an entry, but not the headline or properties
associated with the entry.

- =org-crypt-key= Either the Key ID or set to nil to use symmetric encryption.
- Use =org-encrypt-entry= on a headline to encrypt.
- Similarly, use =org-decrypt-entry= on a headline to decrypt.
- Excluding the /crypt/ tag from inheritance prevents already encrypted text from being encrypted again.

#+begin_src emacs-lisp :tangle lisp/init-org.el
(with-eval-after-load 'org-crypt
  (org-crypt-use-before-save-magic)
  (setq org-crypt-disable-auto-save t
        org-crypt-key user-full-name))
#+end_src
*** Org ID
#+begin_src emacs-lisp :tangle lisp/init-org.el
(with-eval-after-load 'org-id
  (setq org-id-method 'uuid
        org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id
        org-id-locations-file (expand-file-name "org/id-locations.el" forge-state-dir)))
#+end_src
*** Odds and ends
:PROPERTIES:
:ID:       298C200B-CA1E-4F45-AC1E-C0CC17ABE86B
:END:
- [[https://github.com/marsmining/ox-twbs][Org Export to Twitter Bootstrap]]
  - Uses [[https://github.com/hniksic/emacs-htmlize][htmlize]] to fontify some sections.
- [[https://github.com/dakrone/ox-tufte][Org Export to Tufte]]
  - You will need the CSS and fonts from [[https://github.com/edwardtufte/tufte-css][tufte-css]].
- [[https://github.com/yjwen/org-reveal][Org Export to Reveal JS]]

#+begin_src emacs-lisp :tangle lisp/init-org.el
;;(use-package ol-git-link :straight (org-contrib :includes ol-git-link))

(use-package ol-eww
  :ensure nil
  :after org)

;; support links to manual pages
(use-package ol-man
  :ensure nil
  :after org)

(use-package ox-md
  :ensure nil
  :after org)

(use-package org-bullets
  :hook (org-mode . org-bullets-mode))

(use-package htmlize)

;; (use-package ox-twbs
;;   :commands (org-twbs-export-to-html
;;              org-twbs-export-as-html
;;              org-twbs-convert-region-to-html))

;; (use-package ox-reveal
;;   :after org-compat
;;   :custom (org-reveal-note-key-char nil))

;; (use-package ox-tufte :after org)
#+end_src
