emacs.org
** Password management
This configures a couple things: [[https://www.gnu.org/software/emacs/manual/html_mono/auth.html][auth-source]] and [[https://www.passwordstore.org/][password store]].  First, on
MacOS, specify the pass to =gpg= and the type of pinentry.  I use a couple tools
to get passwords from =password-store=.  The first is [[https://github.com/NicolasPetton/pass][pass]] which provides a UI
overview of the password store.  I also use [[https://github.com/ecraven/ivy-pass][ivy-pass]] as a quick way to copy
passwords to the clipboard.

#+begin_src emacs-lisp
(require 'init-pass)
#+end_src

#+begin_src emacs-lisp :tangle lisp/init-pass.el :noweb yes
;;; init-pass.el --- Init password management -*- lexical-binding: t -*-
<<license>>


(when (forge/system-type-darwin-p)
  (setopt epg-gpg-program (executable-find "gpg"))
  (setopt epg-pinentry-mode 'loopback))

(use-package auth-source)

(use-package auth-source-pass
  :after auth-source
  :init
  (setq auth-sources '(password-store "~/.authinfo.gpg")))

;; https://github.com/ccrusius/auth-source-xoauth2
(use-package auth-source-xoauth2
  :after auth-source)

;;
(use-package pass
  :config
  (advice-add 'pass-quit :after 'forge/delete-window))

;; https://github.com/ecraven/ivy-pass
(use-package ivy-pass
  :bind
  ("C-c p" . ivy-pass))

(provide 'init-pass)
#+end_src

