emacs.org
** EShell Terminal
I predominantly use =eshell= for terminal like needs.  There's always
=ansi-term= if for some reason =eshell= isn't a good fit, but I find I rarely
use it nowadays.  If I need a real terminal, I will probably use a proper
terminal application.

I also, on occasion, have a need to use serial console access.  The way to
access this is via =serial-term=.  If using something like =ansi-term= or
=serial-term=, keep in mind the following keybindings.  You probably normally
want to be in /terminal character mode/.
- ~C-c C-j~ / ~term-line-mode~ Terminal line mode.
- ~C-c C-k~ / ~term-char-mode~ Terminal character mode.

Some notes:
- One of the helpers here is =eshell-here=, which will open an =eshell= buffer
  in the directory where the current file is located.
- When closing an eshell buffer, it will delete the window if it is not the only
  one in the frame.

Resources:
- [[https://www.gnu.org/software/emacs/manual/html_mono/eshell.html][Eshell manual]]
- [[https://www.masteringemacs.org/article/complete-guide-mastering-eshell][Mastering Emacs: Mastering Eshell]] by Mickey Petersen
- [[http://howardism.org/Technical/Emacs/eshell-fun.html][Eschewing Zshell for Emacs Shell]] by Howard Abrams

#+begin_src emacs-lisp
(require 'init-term)
#+end_src


#+NAME: eshell
#+begin_src emacs-lisp :tangle lisp/init-term.el :noweb yes
;;; init-term.el --- Init Shell -*- lexical-binding: t -*-
<<license>>


(with-eval-after-load 'em-unix
  (unintern 'eshell/su nil)
  (unintern 'eshell/sudo nil))

(defun eshell-here ()
  "Opens up a new shell in the directory associated with the current buffer's file."
  (interactive)
  (let* ((parent (if (buffer-file-name) (file-name-directory (buffer-file-name)) (getenv "HOME")))
         (height (/ (window-total-height) 3))
         (name (car (last (split-string parent "/" t)))))
    (split-window-vertically (- height))
    (other-window 1)
    (eshell "new")
    (rename-buffer (concat "*eshell: " name "*"))
    (insert (concat "ls"))
    (eshell-send-input)))

(define-key global-map (kbd "C-!") 'eshell-here)

(with-eval-after-load 'eshell

  (defun my-tramp-loaded-p ()
    "Return t if tramp is loaded and nil otherwise."
    (fboundp 'tramp-tramp-file-p))

  (defun my-eshell-tramp-path-p ()
    "Return t if path has tramp file syntax."
    (when (my-tramp-loaded-p)
      (tramp-tramp-file-p default-directory)))

  (defun my-eshell-prompt-user ()
    "Return username on current system for use in eshell prompt."
    (if (my-eshell-tramp-path-p)
        (or (tramp-file-name-user (tramp-dissect-file-name default-directory)) (getenv "USER"))
      (user-login-name)))

  (defun my-eshell-prompt-host ()
    "Return hostname of current system for use in eshell prompt."
    (if (my-eshell-tramp-path-p)
        (tramp-file-name-host (tramp-dissect-file-name default-directory))
      (system-name)))

  (defun my-eshell-prompt-pwd ()
    "Return PWD on current system for use in eshell prompt."
    (abbreviate-file-name
     (if (my-eshell-tramp-path-p)
         (nth 6 (tramp-dissect-file-name default-directory))
       (eshell/pwd))))

  (defun my-eshell-default-prompt ()
    "Generate prompt string for eshell.  Use for `eshell-prompt-function'."
    (let ((user (my-eshell-prompt-user))
          (host (my-eshell-prompt-host))
          (now (format-time-string "%b %d %H:%M" (current-time)))
          (pwd (my-eshell-prompt-pwd)))
      (concat
       "┌─[" user "  " host " " pwd "]─[" now "]\n"
       "└─>"
       (propertize " λ" 'face (if (zerop eshell-last-command-status) 'success 'error))
       " ")))

  (setenv "TERM" "xterm-256color")
  (setq explicit-shell-file-name "/bin/bash") ;; this is from term.el
  (advice-add 'eshell-life-is-too-much :after 'forge/delete-window)
  (setq tramp-default-method "ssh"
        eshell-directory-name (expand-file-name "eshell" forge-state-dir)
        eshell-visual-commands '("less" "tmux" "htop" "top" "docker" "nethack")
        eshell-visual-subcommands '(("git" "log" "diff" "show"))
        eshell-prompt-regexp "^[^#\nλ]*[#$λ] "
        eshell-prompt-function #'my-eshell-default-prompt)
  (add-hook 'eshell-mode-hook (lambda ()
                                (eshell/alias "q" "exit")
                                (eshell/alias "l" "ls -al")
                                (eshell/alias "ll" "ls -al")
                                (eshell/alias "e" "find-file \$1")
                                (eshell/alias "ff" "find-file \$1")
                                (eshell/alias "vi" "find-file \$1")
                                (eshell/alias "d" "dired \$1")
                                (eshell/alias "ee" "find-file-other-window \$1")
                                (eshell/alias "gd" "magit-diff-unstaged")
                                (eshell/alias "gds" "magit-diff-staged")
                                (eshell/alias "gst" "magit-status"))))

#+end_src

The following is a relic from when I used =ansi-term=.  Switch to an =ansi-term=
buffer if it exists; otherwise, create one and switch to it.

#+begin_src emacs-lisp :tangle lisp/init-term.el
(defun my-terminal ()
  "Switch to terminal; launch if non-existent."
  (interactive)
  (if (get-buffer "*ansi-term*")
    (switch-to-buffer "*ansi-term*")
    (ansi-term "/bin/bash"))
  (get-buffer-process "*ansi-term*"))
#+end_src

#+begin_src emacs-lisp :tangle lisp/init-term.el
(provide 'init-term)
#+end_src
** Music
*** Mingus
I don't use MPD much anymore.  I used to use [[https://github.com/pft/mingus][Mingus]] as an Emacs interface to MPD.

#+begin_src emacs-lisp :tangle no
(use-package mingus
  :disabled t
  :preface
  (defun forge/get-current-song-mpd ()
    "Get the current song playing via MPD."
    (interactive)
    (let ((conn (mpd-conn-new "localhost" 6600))
          (cursong nil))
      (condition-case nil
          (setq cursong (split-string (plist-get (mpd-get-current-song conn) 'Title) " - "))
        (error nil))
      cursong)))
#+end_src
*** EMMS
[[https://www.gnu.org/software/emms/][EMMS]] is another Emacs interface to playing multimedia.  I occasionally use this.  The docs are [[https://www.gnu.org/software/emms/manual/][here]].

#+begin_src emacs-lisp :tangle no
(use-package emms
  :disabled t
  :custom
  (emms-directory (expand-file-name "emms" forge-state-dir))
  (emms-source-file-default-directory (expand-file-name "~/annex/Audio"))
  :config
  (emms-all)
  (emms-history-load)
  (setq emms-player-list (list emms-player-mpv)
        emms-stream-info-backend 'mplayer
        emms-source-file-directory-tree-function 'emms-source-file-directory-tree-find
        emms-browser-covers 'emms-browser-cache-thumbnail)
  (add-to-list 'emms-player-mpv-parameters "--no-audio-display")
  (add-to-list 'emms-info-functions 'emms-info-cueinfo)
  (if (executable-find "emms-print-metadata")
      (progn
        (require 'emms-info-libtag)
        (add-to-list 'emms-info-functions 'emms-info-libtag)
        (delete 'emms-info-ogginfo emms-info-functions)
        (delete 'emms-info-mp3info emms-info-functions))
    (add-to-list 'emms-info-functions 'emms-info-ogginfo)
    (add-to-list 'emms-info-functions 'emms-info-mp3info)))

#+end_src
* Miscellaneous Utilities
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/init-utils.el
:END:
The following are miscellaneous utilities that are small but useful.
#+begin_src emacs-lisp :tangle "init.el"
(require 'init-utils)
#+end_src

** Epub reader with [[https://github.com/wasamasa/nov.el][Nov]]
#+begin_src emacs-lisp :noweb yes
;;; init-utils.el --- Init various utilities -*- lexical-binding: t -*-
<<license>>


(use-package nov
  :mode ("\\.epub\\'" . nov-mode)
  :custom (nov-save-place-file (expand-file-name "nov-places" forge-state-dir)))
#+end_src

** [[https://github.com/jschaf/emacs-lorem-ipsum][Lorem Ipsum]]
#+begin_src emacs-lisp
(use-package lorem-ipsum)
#+end_src
** Amateur Radio: Fast Log Entry (FLE) and POTA
#+begin_src emacs-lisp

(use-package ham
  :ensure nil
  :init (init-vc-install :fetcher "github" :repo "sfromm/ham-el")
  :commands (fle-mode pota)
  :magic ("mycall " . fle-mode)
  :config
  (setq-local tab-width 8))
#+end_src
** Network related, ping and traceroute
A place to configure miscellaneous settings for network utilities.

#+begin_src emacs-lisp

(use-package net-utils
  :commands (ping traceroute)
  :custom ((ping-program-options (list "-c" "5"))
           (traceroute-program-options (list "-I" "-m" "30" "-w" "1"))))
#+end_src

Pull in ~ip-query~ for functions to query the [[https://team-cymru.com/community-services/ip-asn-mapping/][IP to ASN Mapping Service]] provided by [[https://team-cymru.com/][Team Cymru]].

#+begin_src emacs-lisp
(use-package ip-query
  :ensure nil
  :init (init-vc-install :fetcher "github" :repo "sfromm/ip-query")
  :commands (ip-query ip-query-asn))
#+end_src

=dig-extended= is meant to be a wrapper around =dig=, using the Emacs [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Advising-Functions.html][advice]] facility.

#+begin_src emacs-lisp
(defun dig-extended (fn &optional
                        domain query-type query-class query-option dig-option server)
  "Wrapper for `dig'.
Query for DNS records for DOMAIN of QUERY-TYPE."
  (message "domain: '%s'" domain)
  (unless domain
    (setq domain (read-string "Host: ")))
  (unless query-type
    (setq query-type (completing-read "Type: " '("A" "SOA" "NS" "TXT" "CNAME" "PTR"))))
  (funcall fn domain query-type query-class query-option dig-option server))

(advice-add 'dig :around #'dig-extended)
#+end_src

A wrapper around calling ~sntp~.

#+begin_src emacs-lisp
(defun my-eshell-sntp-set-time (&optional server)
  "Set time from sntp server SERVER."
  (interactive "P")
  (let ((server (or server "time.apple.com")))
    (eshell-command (concat "sudo sntp -sS " server))))
#+end_src

** Search / Ripgrep
[[https://github.com/dajva/rg.el][rg.el]] is a frontend to [[https://github.com/BurntSushi/ripgrep][ripgrep]].

#+begin_src emacs-lisp

(use-package rg)
#+end_src

** [[https://github.com/defunkt/gist.el][Gist]]
#+begin_src emacs-lisp
(use-package gist
  :custom (gist-view-gist t))
#+end_src
