lisp/init-utils.el
  :mode ("\\.epub\\'" . nov-mode)
  :init
  (setq nov-save-place-file (expand-file-name "nov-places" forge-state-dir)))

(use-package lorem-ipsum)


(use-package ham
  :ensure nil
  :init (init-vc-install :fetcher "github" :repo "sfromm/ham-el")
  :commands (fle-mode pota)
  :magic ("mycall " . fle-mode)
  :config
  (setq-local tab-width 8))


(use-package net-utils
  :commands (ping traceroute)
  :config
  (setq ping-program-options (list "-c" "5"))
  (setq traceroute-program-options (list "-I" "-m" "30" "-w" "1")))

(use-package ip-query
  :ensure nil
  :init (init-vc-install :fetcher "github" :repo "sfromm/ip-query")
  :commands (ip-query ip-query-asn))

(defun dig-extended (fn &optional
                        domain query-type query-class query-option dig-option server)
  "Wrapper for `dig'.
Query for DNS records for DOMAIN of QUERY-TYPE."
  (message "domain: '%s'" domain)
  (unless domain
    (setq domain (read-string "Host: ")))
  (unless query-type
    (setq query-type (completing-read "Type: " '("A" "SOA" "NS" "TXT" "CNAME" "PTR"))))
  (funcall fn domain query-type query-class query-option dig-option server))

(advice-add 'dig :around #'dig-extended)

(defun my-eshell-sntp-set-time (&optional server)
  "Set time from sntp server SERVER."
  (interactive "P")
  (let ((server (or server "time.apple.com")))
    (eshell-command (concat "sudo sntp -sS " server))))


(use-package rg)

(use-package gist
  :custom (gist-view-gist t))
