emacs.org
** Mastodon
https://codeberg.org/martianh/mastodon.el

The following variables are set with ~customize~:
- =mastodon-instance-url=
- =mastodon-active-user=

#+begin_src emacs-lisp :tangle lisp/init-utils.el

(use-package mastodon
  :custom
  (mastodon-client--token-file (expand-file-name "mastodon/mastodon.plstore" forge-state-dir))
  :config
  (mastodon-discover))

;; heavily borrowed from sachac
;; The description needs more work.
;; It should also capture the date in an org format

(defun my-mastodon-store-link ()
  "Store links from Mastodon buffers."
  (when (derived-mode-p 'mastodon-mode)
    (let ((json (get-text-property (point) 'item-json)))
      (org-link-store-props
       :link (mastodon-toot--toot-url)
       :description (concat (let-alist (mastodon-tl--property 'item-json) .account.display_name)
                            " "
                            (let-alist (mastodon-tl--property 'item-json) .account.acct))
       :content (mastodon-tl--content json)
       :text (concat
              (string-trim (mastodon-tl--render-text (mastodon-tl--content json)))
              (when (assoc-default 'media_attachments json)
                (concat "\n\n"
                        (mapconcat (lambda (attachment)
                                     (org-link-make-string
                                      (assoc-default 'url attachment)
                                      (assoc-default 'description attachment)))
                                   (assoc-default 'media_attachments json)
                                   "\n")))
              )
       ))
    ))

(use-package org
  :config
  (org-link-set-parameters
   "mastodon"
   :store 'my-mastodon-store-link)
  (with-eval-after-load 'org-capture
    (add-to-list 'org-capture-templates
                 `("rt" "Mastodon Toot" entry
                   (file+olp+datetree "articles.org")
                   "* %a on Mastodon %?  :TOOT:\n:PROPERTIES:\n:URL: %:link\n:CAPTURED:  %U\n:END:\n#+BEGIN_QUOTE\n%:text\n#+END_QUOTE\n"
                   :prepend t))))
#+end_src

Keybindings of note:

| Keybinding | Command                                       |
|------------+-----------------------------------------------|
| n          | Go to next item                               |
| p          | Go to previous item                           |
| g, u       | Update current timeline                       |
| M-n        | Go to next "interesting" actionable thing     |
| M-p        | Go to previous "interesting" actionable thing |
| F          | Open federated timeline                       |
| H          | Open home timeline                            |
| L          | Open local timeline                           |
| N          | Open notifications timeline                   |
| T          | Open thread for toot under point              |
| A          | Open author profile under point               |
| P          | Open profile of user under point              |
** Weather with [[https://github.com/bcbcarl/emacs-wttrin][Wttrin]]
#+begin_src emacs-lisp
(use-package wttrin
  :ensure nil
  :init (init-vc-install :fetcher "github" :repo "sfromm/emacs-wttrin")
  :commands (wttrin)
  :custom
  (wttrin-default-cities '("Eugene" "Portland" "Sonoma" "Kapolei" "New Orleans"))
  (wttrin-language "en-US"))
#+end_src
** World Clock
Because sometimes I work with people in more than one timezone.  ~M-x world-clock~ to the rescue.

#+begin_src emacs-lisp
(setq zoneinfo-style-world-list ; M-x shell RET timedatectl list-timezones or M-x dired RET /usr/share/zoneinfo
      '(("America/Los_Angeles" "Los Angeles")
        ("America/Denver" "Denver")
        ("America/Chicago" "Chicago")
        ("America/New_York" "New York")
        ("Canada/Atlantic" "Canada/Atlantic")
        ("UTC" "UTC")
        ("Europe/London" "London")
        ("Europe/Lisbon" "Lisbon")
        ("Europe/Brussels" "Barcelona • Paris • Brussels • Berlin")
        ("Europe/Athens" "Athens • Cairo • Kyiv")
        ("Asia/Tel_Aviv" "Tel Aviv")
        ("Asia/Kolkata" "Kolkata")
        ("Asia/Shanghai" "Beijing • Shanghai")
        ("Asia/Seoul" "Seoul")
        ("Asia/Tokyo" "Tokyo")
        ("Asia/Vladivostok" "Vladivostok")
        ("Australia/Brisbane" "Brisbane")
        ("Australia/Sydney" "Sydney")
        ("Pacific/Auckland" "Auckland")
        ("Pacific/Honolulu" "Honolulu")))
(setq world-clock-list t
      world-clock-buffer-name "*world-clock*"
      world-clock-time-format "%R %Z (%z)  %A %d %B")

(defun my-date-utc-to-local (beg end &optional date)
  "Convert UTC date string to local time."
  (interactive "r")
  (let ((format "%F %T %Z %z")
        (zone nil))
    (message
     "Date: %s"
     (format-time-string
      format
      ;; There appears to be a quirk in parse-time-string, called by date-to-time,
      ;; where it does not recognize UTC as a TZ.  It needs to be UT or GMT.
      ;; See parse-time.el line 93.
      (date-to-time
       (string-replace
        "UTC" "GMT"
        (if (use-region-p)
            (buffer-substring-no-properties beg end)
          (read-string "UTC date: ")))) zone))))
#+end_src
** VPN helpers
Helpers to connect and disconnect from a VPN session.

#+begin_src emacs-lisp

(defvar forge/vpn-config ""
  "Name of the OpenVPN VPN configuration to use.")

(when (forge/system-type-darwin-p)
  (defun vpn-connect ()
    "Connect to VPN configuration CFG.
Assumes you are are on MacOS and using Wireguard to connect."
    (interactive)
    (require 'em-glob)
    (let ((cfg (completing-read "Config: "
                                (mapcar #'file-name-sans-extension
                                        (directory-files "~/annex/etc" nil (eshell-glob-regexp "wg*conf"))))))
      (setq forge/vpn-config cfg)
      (when (forge/system-type-darwin-p)
        (shell-command (concat "scutil --nc start " cfg)))))

  (defun vpn-disconnect ()
    "Disconnect VPN configuration CFG.
Assumes you are are on MacOS and using Wireguard to connect."
    (interactive)
    (when (forge/system-type-darwin-p)
      (shell-command (concat "scutil --nc stop " forge/vpn-config))))

  (defun openvpn-connect ()
    "Connect to OpenVPN configuration CFG.
Assumes you are on MacOS and using Tunnelblick to connect."
    (interactive)
    (require 'em-glob)
    (let ((cfg (completing-read "Config: "
                                (mapcar #'file-name-sans-extension
                                        (directory-files "~/annex/etc" nil (eshell-glob-regexp "*ovpn"))))))
      (setq forge/vpn-config cfg)
      (when (forge/system-type-darwin-p)
        (let ((osatmpl ""))
          (setq osatmpl (concat "tell application \"/Applications/Tunnelblick.app\"\n"
                                "    connect \"" cfg "\"\n"
                                "end tell"))
          (do-applescript osatmpl)))))

  (defun openvpn-disconnect ()
    "Disconnect from VPN.
Assumes you are on MacOS and using Tunnelblick to manage your VPN."
    (interactive)
    (let ((osatmpl ""))
      (setq osatmpl (concat "tell application \"/Applications/Tunnelblick.app\"\n"
                            "    disconnect \"" forge/vpn-config "\"\n"
                            "end tell"))
      (do-applescript osatmpl))))

#+end_src

** Home Makefile helpers
#+begin_src emacs-lisp
(defmacro forge-mkhome-target (target)
  "Macro to run mkhome makefile TARGET."
  `(with-temp-buffer
     (progn
       (cd (getenv "HOME"))
       (compile (mapconcat 'shell-quote-argument (list "make" "-f" "Makefile.mkhome" ,target) " ")))))

(defun forge-mkhome-update ()
  "Run mkhome git."
  (interactive)
  (forge-mkhome-target "update"))

(defun forge-mkhome-www ()
  "Run mkhome www."
  (interactive)
  (forge-mkhome-target "www"))

(defun forge-mkhome-src ()
  "Run mkhome src."
  (interactive)
  (forge-mkhome-target "src"))
#+end_src

** Get currently playing song
Lastly, this returns the currently playing song in iTunes.

Useful resources:
- https://apple.stackexchange.com/questions/297240/getting-the-file-path-of-a-currently-playing-itunes-track-with-applescript
- https://alvinalexander.com/blog/post/mac-os-x/applescript-concatenate-strings

#+begin_src emacs-lisp

(when (forge/system-type-darwin-p)
  (defun my-get-current-song-itunes ()
    "Get current song playing via itunes."
    (let ((osa-tmpl "")
          (cursong nil))
      (setq osa-tmpl "tell application \"Music\"
	if player state is not stopped then
		set ct to (properties of current track)
		set this_song to \"\"
		if (class of ct is URL track) and (get current stream title) is not missing value then
			set this_song to (get current stream title)
		else
			set this_song to artist in ct & \" - \" & name in ct
		end if
		this_song
	end if
end tell")
      (condition-case nil
          (setq cursong (split-string (do-applescript osa-tmpl) " - "))
        (error nil))
      cursong)))

#+end_src
** Bookmark opener
Inspired and borrowed from [[https://xenodium.com/building-your-own-bookmark-launcher/][Alvaro Ramirez]]:

#+begin_src emacs-lisp
(defun my-org-web-bookmarks (path)
  "Return all HTTP links from an org-file at PATH."
  (with-temp-buffer
    (let (links)
      (insert-file-contents path)
      (org-mode)
      (org-element-map (org-element-parse-buffer) 'link
        (lambda (link)
          (let* ((raw-link (org-element-property :raw-link link))
                 (content (org-element-contents link))
                 (title (substring-no-properties (or (seq-first content) raw-link))))
            (when (string-prefix-p "http" raw-link)
              (push (concat title "\n" (propertize raw-link 'face 'whitespace-space) "\n")
                    links))))
        nil nil 'link)
      (seq-sort 'string-greaterp links))))

(defun my-open-browser-bookmark ()
  "Send a bookmark to the browser from the bookmark file."
  (interactive)
  (browse-url
   (seq-elt
    (split-string
     (completing-read "Open: " (my-org-web-bookmarks (expand-file-name "notebook.org" org-directory))) "\n") 1)))
#+end_src
** Helper functions
